[{"id":"b09edef6-bc8f-11e7-8a71-1a99bf37a7f7","created_at":"Sun Oct 29 09:59:12 UTC 2017","title":"Software Engineer","location":"Tokyo, Japan","type":"Full Time","description":"<h1>What you’ll do</h1>\n\n<p>Develop an antenna sharing platform and satellite communications service to support the next generation of the space industry Create fast and scalable backend systems on a global infrastructure to serve users all over the world Build an intuitive and highly interactive satellite flight / mission control UI Come up with novel signal-processing and big-data techniques to open up satellite communication to a new class of off-the-shelf hardware</p>\n\n<h1>Minimum Qualifications</h1>\n\n<ul>\n<li>BS degree in Computer Science, Mechanical Engineering, Physics, Math or similar technical field of study or equivalent practical experience</li>\n<li>Development experience on Unix / Linux</li>\n<li>Software development experience in one or more general purpose programming languages such as Java, C/C++, C#, Objective C, Python, or Go</li>\n<li>Experience working with two or more of the following: web application development, mobile application development, distributed and parallel systems, machine learning, data mining, signal processing, networking, developing large software systems, and/or security software development</li>\n<li>Working proficiency and communication skills in verbal and written English</li>\n</ul><h1>Preferred Qualifications</h1>\n\n<ul>\n<li>Experience working with two or more general purpose programming languages, and interest and ability to learn other coding languages as needed</li>\n<li>Experience leading development and operation of large-scale service with dozens of users or more</li>\n<li>Experience designing, building and maintaining a platform for large-scale data collection, analysis and mining</li>\n<li>Deep knowledge of latest cloud and software technologies such as containers, AWS/GCP and gRPC</li>\n</ul>","how_to_apply":"<p>Apply for this job:\n<a href=\"https://docs.google.com/forms/d/e/1FAIpQLSfeNaKfAkY2mQ76FXJUQ79O7ZC6QmK6X2r1Op5t8iybxNrXLw/viewform\">https://docs.google.com/forms/d/e/1FAIpQLSfeNaKfAkY2mQ76FXJUQ79O7ZC6QmK6X2r1Op5t8iybxNrXLw/viewform</a></p>","company":"Infostellar","company_url":"http://infostellar.net","company_logo":"http://github-jobs.s3.amazonaws.com/0b21118c-bc90-11e7-93cc-b377f4744600.png","url":"http://jobs.github.com/positions/b09edef6-bc8f-11e7-8a71-1a99bf37a7f7"},{"id":"76bcad38-bc5a-11e7-8712-d94475fe31bc","created_at":"Sun Oct 29 03:49:02 UTC 2017","title":"QA Engineer","location":"Berkeley, CA","type":"Full Time","description":"<p>Bonsai’s Automation and QA team is looking for a talented programmer, creative software-breaker, and passionate tester, to maintain Bonsai’s high standard of software quality and help the engineering team go faster without breaking things.</p>\n\n<p>As the champion for software quality and correctness, you’ll work with all areas of Engineering and AI, as well as Product and Customer Success, to consult on and create test plans, manage our CI infrastructure, build tools to make testing easier company-wide, and implement black-box tests that exercise our platform end-to-end.</p>\n\n<p>RESPONSIBILITIES</p>\n\n<p>Work with Engineering teams, including Backend, Compiler, Web, and AI, to design and implement test plans for features that span multiple teams.</p>\n\n<p>Design and implement tools that enable Bonsai developers to more quickly create tests that can be seamlessly automated.</p>\n\n<p>Provision and manage test automation and continuous integration systems.</p>\n\n<p>Create reports detailing test failures, test coverage, and system performance.</p>\n\n<p>SKILLS AND EXPERIENCE</p>\n\n<p>A passion for software quality.</p>\n\n<p>At least 2-3 years of industry experience as a Software Developer Engineer in Test or similar.</p>\n\n<p>Proficiency with a general purpose language like Python or C++, plus experience with a test framework in that language.</p>\n\n<p>Experience with Jenkins or a similar Continuous Integration tool.</p>\n\n<p>Demonstrated experience working collaboratively with teams of developers.</p>","how_to_apply":"<p>Apply on our website <a href=\"http://www.bons.ai\">www.bons.ai</a></p>","company":"Bonsai AI, Inc.","company_url":"http://Bons.ai","company_logo":"http://github-jobs.s3.amazonaws.com/665e50fe-bc5a-11e7-816d-b29b64d36d6f.png","url":"http://jobs.github.com/positions/76bcad38-bc5a-11e7-8712-d94475fe31bc"},{"id":"f8d4627a-7830-11e7-9e78-d9b1c842a413","created_at":"Fri Oct 27 16:43:37 UTC 2017","title":"Linux System Administrator / System Engineer","location":"Hamburg","type":"Full Time","description":"<p>Do you want to work at scale? As part of our Backend Operations team, you will be responsible for services used by millions of players all around the world. You will work closely with our developers to run in house and open source solutions. We love to know every corner of our systems and most of them are on our own hardware in datacenters in Hamburg and overseas.</p>\n\n<p><strong>Your profile:</strong></p>\n\n<ul>\n<li>Some years professional experience administering *nix systems </li>\n<li> Comfortable with using various command line tools e.g. (d|net|vm|io)?stat</li>\n<li> Proficient in at least one scripting language</li>\n<li>Open and friendly communication style</li>\n<li>Good English skills</li>\n</ul><p><strong>Our technologies:</strong></p>\n\n<ul>\n<li>KVM, LVM, Debian, Puppet</li>\n<li>MySQL (Percona, Galera Cluster), PostgreSQL, Redis, Memcached, RabbitMQ</li>\n<li>nginx, Tomcat, Jetty, Django</li>\n<li>Python, Java, PHP, Go</li>\n<li>Graphite / Grafana, Nagios, Sentry, ELK stack</li>\n<li>git, Jenkins, Maven, Docker</li>\n<li>Slack, Jira, Confluence, Bitbucket, Gitlab</li>\n</ul><p><strong>Why join InnoGames?</strong></p>\n\n<ul>\n<li>Be part of a great team in an international environment in a healthy and stable growing company.</li>\n<li>Choose your preferred device (Linux, Mac or even Windows) for your comfortable workplace</li>\n<li>We will actively support your further development and give you all needed resources to evaluate new technologies, participate in open source communities or improve your soft skills.</li>\n<li>Our career model is set up equally for an expert in a technical career or a management path.</li>\n<li>Opportunities to make your code open source and show your achievements at international conferences.</li>\n<li>Competitive compensation</li>\n<li>Benefits like relocation support, company gym, smartphone or tablet, company bikes, rooftop terrace with BBQ and much more…</li>\n<li>Check out some of our code: <a href=\"github.com/innogames\">github.com/innogames</a>\n</li>\n</ul><p><a href=\"https://www.innogames.com/career/detail/job/linux-system-administrator-system-engineer?s=GitHub\">Apply here</a></p>","how_to_apply":"<p><a href=\"https://www.innogames.com/career/detail/job/linux-system-administrator-system-engineer?s=GitHub\">Online application form</a></p>","company":"InnoGames GmbH","company_url":"http://www.innogames.com","company_logo":"http://github-jobs.s3.amazonaws.com/e76e2732-7830-11e7-8084-c889d66963f3.png","url":"http://jobs.github.com/positions/f8d4627a-7830-11e7-9e78-d9b1c842a413"},{"id":"cd457406-ba7e-11e7-9cac-ef0cf8ad5461","created_at":"Thu Oct 26 18:52:23 UTC 2017","title":"Software Developer","location":"Phoenix, AZ, US","type":"Full Time","description":"<p></p><h3>\n<strong>Location:</strong> Phoenix, remote within 1 hour travel also acceptable<br><strong>Type:</strong> Fulltime.<br><strong>Experience:</strong> Senior (Prior software development experience is mandatory)<br> </h3><h3>About Us: </h3><ul><li>Privacy-focused company providing email and communication applications for web and mobile. </li></ul><h3>Description:</h3><ul><li>    <p>Our developers frequently transition between front-end, back-end, iOS, Android, and other projects. Our strength comes from our speed and agility, and our ability to refocus the engineering team based on current priorities. You will have the opportunity to work on challenging problems anywhere in our stack. You will be working both internally with the engineering team, and also with remote developers.</p> </li></ul><h3>Requirements:</h3><ul>\n<li>    <p>Prior experience building distributed applications at web scale</p>  </li>   <li>    <p>Python experience is a must</p>  </li>   <li>    <p>Expert-level in at least TWO of the following languages: Python, Javascript, Objective-C, Swift, Java</p>    </li>   <li>    <p>Expert-level with at least ONE of the following frameworks or environments: React, React Native, Redux</p>  </li>   <li>    <p>You'll have to be able to become proficient in similar languages or frameworks very quickly</p>  </li>   <li>    <p>Experience in developing software using at least TWO of: WebRTC, AMQP, UDP or TCP socket programming</p>    </li>   <li>    <p>Familiarity with DNS and HTTP </p>  </li>   <li>    <p>Strong English communication skills</p>  </li>   <li>    <p>Extensive experience working on extremely complex software projects</p>  </li>   <li>    <p>Strong background in computer science (algorithms, data structure, software design, reliability, maintainability, etc)</p>   </li>   <li>    <p>Ability to keep up in an extremely fast-paced environment</p>    </li>\n</ul><h3>Bonus Points:</h3><ul>\n<li>    <p>Well versed in security and with a good understanding of security best practices from a programming point of view</p>    </li>   <li>    <p>Fluent in UNIX/Linux</p> </li>   <li>    <p>GPG, S/MIME experience</p>   </li>   <li>    <p>NaCL experience</p> </li>\n</ul><h3>Why work here:</h3><ul>\n<li>    <p>Flexible and casual working environment</p>  </li>   <li>    <p>Startup environment where everyone matters and can make a big impact</p> </li>   <li>    <p>Work in an ultra high growth environment solving interesting problems, there is never a boring moment</p>    </li>   <li>    <p>Fast growth also means there are many opportunities for rapid advancement</p>    </li>   <li>    <p>Do something meaningful. Our applications protect dissidents, journalists, and activists. Our work literally impacts lives.</p>  </li>   <li>    <p>Be part of something bigger. Millions of people and businesses around the world have embraced our idea of an Internet where privacy and security are the default, and not merely an afterthought. Be part of this revolution that is changing the world.</p> </li>\n</ul><img src=\"https://www.applytracking.com/track.aspx/7YLuL\">","how_to_apply":"<p><a href=\"https://www.applytracking.com/track.aspx/7YLuV\">https://www.applytracking.com/track.aspx/7YLuV</a></p>","company":"TrustCor","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/cd457406-ba7e-11e7-9cac-ef0cf8ad5461"},{"id":"cd97557c-b8ea-11e7-9817-ea693bb3405c","created_at":"Tue Oct 24 18:49:03 UTC 2017","title":"Software Engineer - Java","location":"Los Angeles, CA","type":"Full Time","description":"<p>We are looking for a Java Software Engineer with solid foundation in software engineering and an insatiable craving to learn new technologies. Impressive contenders are self-motivated and continually strive to develop excellent architecture and high quality code, while being mindful of the whole ecosystems. Does this sound like you? If so, you will be designing and developing web-based applications using Java technologies and integrating with Cloud based services. Do you flourish when using Scrum methodology in the software development life cycle? If so, you should take a closer look at the details.</p>\n\n<p>Your Responsibilities</p>\n\n<ul>\n<li>Participate in Agile software development projects; tasks include coding, testing, debugging, documentation, peer-review, deploying, monitoring, and support. </li>\n<li>Engage in task identification, work effort estimates, and work schedules for development and maintenance activities. </li>\n<li>Create and maintain technical documentation using defined templates. </li>\n<li>Ensure that all tasks are performed in accordance with specific internal procedures and standards, as well as industry validated methods </li>\n<li>Ensure and demonstrate code quality through comprehensive and effective unit testing coverage, usage of automated testing and test harnesses </li>\n<li>Collaborate with a cross-functional team of developers, project managers, product managers, quality assurance, management and operations. </li>\n<li>Provide technical expertise in assessing application and configuration failures, including the analysis of complex problems and issues. Develop and implement recommended solutions. </li>\n<li>Perform coding to written technical specifications. </li>\n<li>Investigate, analyze and document reported defects. </li>\n<li>Perform maintenance programming and correction of identified defects. </li>\n<li>Deliver complex enterprise applications with high code standards</li>\n</ul><p>You have the following skills</p>\n\n<ul>\n<li>3+ years of software engineering with Java and related technologies, including server side application design and debugging </li>\n<li>Excellent knowledge in Java/J2EE/Spring and solid working knowledge of Spring Framework especially REST, Core and JDBC components </li>\n<li>Experience with other programming languages e.g. Python, Scala </li>\n<li>Experience with Maven and Continuous Build Process such as Jenkin, Bamboo </li>\n<li>Experience with Cloud based services such as Amazon Web Services </li>\n<li>Experience with developing on and deploying to Linux systems </li>\n<li>Excellent Database SQL skills preferably in Oracle </li>\n<li>Experience with the design, development, testing and deployment of enterprise class web-based applications </li>\n<li>Computer Science or Software Engineering degree or equivalent work experience.</li>\n</ul><p>You might have some of these</p>\n\n<ul>\n<li>Real passion for achieving team success and eagerness to mentor colleagues globally in quality software engineering practices </li>\n<li>Proficiency with the Java umbrella of technologies </li>\n<li>Application server development - Service layer patterns using Spring/Hibernate/EJB </li>\n<li>Multiple RDBMS – SQL – PostgreSQL, MySQL, SQLServer </li>\n<li>J2EE server environments - JBoss, Glassfish, Tomcat, and others </li>\n<li>Unix and/or Linux platforms (for support and deployment purposes) </li>\n<li>IDEs – Eclipse, IntelliJ </li>\n<li>Build and development web technologies – Ant, Maven, AntHill, GIT, Servlets, MVC, SpringMVC, Struts, JSP </li>\n<li>Deployment and CI technologies– Jenkins, Puppet, Anible, Hiera, Spacewalk </li>\n<li>Testing frameworks – Junit, Mockito, Cucumber </li>\n<li>REST and Resource Oriented Approaches </li>\n<li>Strong emphasis on QA standard methodologies and industry-leading processes along with a strong dedication to Agile, Scrum, Test-Driven Development, Behavioral Driven Development</li>\n</ul><p>Meet Boingo</p>\n\n<p>Boingo Wireless, Inc. (NASDAQ: WIFI) helps the world stay connected. Our vast footprint of Wi-Fi and cellular networks covers more than a million locations and reaches over a billion consumers annually – in places as diverse as airports, stadiums, universities, and military bases. The Boingo platform drives revenue through various products, including Wi-Fi, DAS (cellular), Media, Wholesale, and more.</p>\n\n<p>We’re a team of enthusiastic pros who are the best at what they do, and love working hard to grow our business. We work hard, but have fun too. Boingo encourages a super-fun working environment. You will have access to our red carpet experiences such as yoga, bowling, pool tournaments, all kinds of parties and more. There’s also a kitchen stocked with yummy snacks and drinks, an unlimited vacation policy, and a tremendous benefits package that includes equity. Plus, our new award-winning WWHQ, located in Westwood, CA, has 360-degree views of LA, from Catalina to the Hollywood Sign. It’s no wonder we were recently named one of the Best Places to Work in LA!</p>\n\n<p>Boingo is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, gender, gender identity, sexual orientation, age, status as a protected veteran, among other things, or status as a qualified individual with disability.</p>","how_to_apply":"<p><a href=\"http://grnh.se/m8kr3h1\">http://grnh.se/m8kr3h1</a></p>","company":"Boingo Wireless","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/cd97557c-b8ea-11e7-9817-ea693bb3405c"},{"id":"e3749702-b803-11e7-8cc1-e1c5d49c4d96","created_at":"Mon Oct 23 15:09:08 UTC 2017","title":"Senior C++ Software Engineer (m/f)","location":"Munich","type":"Full Time","description":"<p>We are looking for an excellent problem solver for our unique cross functional machine team in Munich. We offer a challenging position in a fast growing, innovative company. Make a change in the health sector and contribute to our digital fitness solution!</p>\n\n<p>Your daily workout</p>\n\n<ul>\n<li>You will work on the team responsible for the software of our electronic fitness machines to build \nawesome consumer products</li>\n<li>You will take ownership and develop fundamental improvements to our user experience, such as \nimproved training feedback and gamification features</li>\n<li>Your developer’s end-to-end responsibility also includes architecting solutions with a high degree \nof freedom, documentation, testing or operational tasks in our cloud-based infrastructure</li>\n<li>You enjoy facilitating technology &amp; architecture decisions and are passionate about mentoring \nother engineers</li>\n</ul><p>Your fitness level</p>\n\n<ul>\n<li>You have at least a Bachelor degree in computer sciences or a similar qualification</li>\n<li>You bring at least 3-5 years of practical experience in C++ development</li>\n<li>You know your way around best practices (e.g. TDD. Code-reviews, continious integration, etc.), \nas well as tools and frameworks to deliver high-quality Qt user interface applications</li>\n<li>You feel comfortable working with a GNU/Linux based development environment, Git, and scripting \nlanguages (e.g. Python)</li>\n<li>Experience with embedded software development or webservice/backend development is a plus</li>\n</ul><p>The equipment we provide (visit us on kununu and on glassdoor)  </p>\n\n<ul>\n<li>Enjoy to be part of our fast-growing start-up company</li>\n<li>Work in a motivated and ambitious team</li>\n<li>Develop your skills with challenging, diverse and meaningful tasks</li>\n<li>Enjoy Coding Dojos and regular team events as well as office parties</li>\n<li>Workout for free in our Munich Office Gym </li>\n<li>Freely assign 10% of your time to own business-related projects during eGym Innovation week</li>\n</ul><p>Your personal trainer</p>\n\n<p>eGym develops, manufactures and sells advanced software and hardware products for the fitness market. We develop electronic fitness machines and mobile applications connected to our cloud infrastructure. Our iPad app allows the trainers to support the members more effectively by giving them access to workout schedules and training results. Users are enabled to track their training progress using our fitness machines and mobile apps.\nThe machine software team is responsible for operating and developing the graphical user interface (GUI), and the related cloud-based infrastructure (web-services ranging from synchronization of exercise data over deployment of GUI-Software to machine production support). We employ technologies such as C++14 with Qt/QML, as well as micro-services based on Python, Java and Scala.</p>\n\n<p>Contact: Alexandra  Stangl</p>\n\n<p>For further vacancies: <a href=\"https://career.egym.com\">https://career.egym.com</a> </p>\n\n<p>This data protection statement applies for the application process.</p>","how_to_apply":"<p>Apply now at <a href=\"mailto:jobs@egym.de\">jobs@egym.de</a> (Cover Letter, CV, references, salary expectations and earliest possible start date in one PDF file) and specify the job ID #449.</p>","company":"eGym GmbH","company_url":"http://www.career.egym.de","company_logo":null,"url":"http://jobs.github.com/positions/e3749702-b803-11e7-8cc1-e1c5d49c4d96"},{"id":"efabbad8-b50f-11e7-90dc-8f569117d31f","created_at":"Thu Oct 19 20:57:31 UTC 2017","title":"Senior Software Engineer","location":"Minneapolis","type":"Full Time","description":"<p><strong>Who we are</strong></p>\n\n<p>Kipsu is a six-year old, bootstrapped software company whose messaging tools keep personal connections at the heart of service. We’re looking for driven, inventive, and positive-minded engineers with 3 – 5 years of experience to play a vital role in shaping our product and culture as we continue on a trend of rapid growth. Additionally...</p>\n\n<ul>\n<li>We bootstrapped this company ourselves and are in it for the long-term. There is a distinct sense of purpose at Kipsu as we do things on our own terms.</li>\n<li>Be a key player on an engineering team of 10 and at a company of 40.</li>\n<li>Have an impact. Your voice matters in how we do things. Help us shape the future of the company.</li>\n<li>Advance your knowledge and career rapidly along with us as we grow.</li>\n</ul><p><strong>What to expect</strong></p>\n\n<ul>\n<li>You’ll be empowered to design systems, select technologies, and drive meaningful changes in collaboration with a passionate team.</li>\n<li>You’ll rely on object-oriented principles and solid coding practices as the foundation of everything we build. Our stack includes apps and services in PHP, Javascript / Node.js, Go, Python, and Swift.</li>\n<li>You’ll join and help shape a team of full stack engineers that embraces DevOps not just as jargon but as a philosophy. Expect to be a part of zero-downtime deployments to our highly available infrastructure on AWS.</li>\n<li>Embrace a culture of learning and take a “no fear” attitude toward solving interesting problems both in application development and beyond in areas like data analysis, natural language processing, machine learning, microservice architecture, and more.</li>\n<li>You’ll participate in blameless sprint retrospectives with a focus on experimentation and continuous improvement. You’re not going to hear us say “because that’s the way we’ve always done it.” At the same time, you won’t be subject to another “re-org” every 6 months.</li>\n<li>Expect plenty of opportunities for leadership from day one and onward as we scale and you advance your career at Kipsu. We see all of our current team members as tomorrow’s leaders.</li>\n</ul><p><strong>Why you'll love it</strong></p>\n\n<ul>\n<li>Unity– Everyone here is focused on the same goal. We share the same core values, and we share in our success. Our team members always have each other’s backs when it counts.</li>\n<li>Transparency– Our leadership gets into the details at our weekly “all hands” meetings. We want everyone to have a full understanding of the business and to “think like a CEO”.</li>\n<li>Trust– Our team members are given the trust and license to excel at their jobs, and are supported along the way to continuously grow.</li>\n<li>Respect– Everyone here has a voice that is heard and respected. We strive to build a diverse team of people from many backgrounds, each bringing something different into our shared culture, and we believe that our success and future as an industry leader depend on it.</li>\n<li>Purpose– Everyone here is closely connected to the result of their work. Every day our team gets to see the impact of what they do on our customers and their customers and you can feel that energy come out in our work.</li>\n<li>Fun– Our kickball team wins the “Spirit” category (and we’re not bad, really!); we have a Slack channel dedicated exclusively to Jeff Bezos GIFs; we are a Best Place to Work in Minneapolis.</li>\n</ul>","how_to_apply":"<p>Please answer the following questions in a cover letter and send that plus your resume to resume (at) kipsu (dot) com.</p>\n\n<p>In your experience, what is it that distinguishes a senior engineer from an entry-level one? How has your perspective as an engineer changed since the start of your career? We're excited to hear from you!</p>","company":"Kipsu, Inc.","company_url":"http://Kipsu, Inc.","company_logo":"http://github-jobs.s3.amazonaws.com/b131e698-b4ff-11e7-8bee-b01af7924c57.png","url":"http://jobs.github.com/positions/efabbad8-b50f-11e7-90dc-8f569117d31f"},{"id":"8e98eac8-b504-11e7-9da8-0737a3dcef18","created_at":"Thu Oct 19 19:35:46 UTC 2017","title":"Senior Platform Engineer (DevOps): Post-Startup Hedge Fund","location":"London","type":"Full Time","description":"<p><strong>Role</strong></p>\n\n<p>This is an outstanding opportunity for the right person in terms of the intrinsic challenges of the role, the responsibility, the exposure to senior management, the opportunity to shape the development of something new, and over time the compensation</p>\n\n<p>Whilst we are a commercial enterprise, we highly value <strong>deep technical expertise and the cultivation of craft</strong>.    You will be working closely with the Partner in charge of technology, who is a contributor to the open source community (*)and a change agent for the devops way within the company.</p>\n\n<p>*(<a href=\"https://github.com/kaleidicassociates\">GitHub</a> | \n<a href=\"https://dlang.org/blog/2017/05/31/project-highlight-excel-d/\">Blog interview of team member for work we sponsor</a>) | <a href=\"https://github.com/libmir/mir-algorithm\">Mir-algorithm</a>)</p>\n\n<p>We currently outsource our technology infrastructure to a managed service provider and, as our business has developed, we have decided to <strong>take control of our infrastructure ourselves, adopting a barbell strategy of co-location and rented bare-metal</strong>.</p>\n\n<p>As a senior platform engineer, you will be responsible for creating processes in the new environment for:</p>\n\n<ul>\n<li>monitoring internal services and applications</li>\n<li>maintaining, deploying and configuring applications and services</li>\n</ul><p>and you will be:</p>\n\n<ul>\n<li>supporting business continuity including building  backup infrastructure for our main systems</li>\n<li>Identifying the weak points in our technology processes and collaboratively addressing these</li>\n<li>proposing strategies to create better collaboration between different functions and to create cross-functional teams</li>\n</ul><p>You will be working closely with your counterpart in Hong Kong: this is likely to be a career professional sysadmin/devops practitioner who is also a hardware hacker and has spoken at Linux Conf Australia about his work.</p>\n\n<p><strong>About Us</strong></p>\n\n<p>Symmetry Investments is a global investment company with offices in Hong Kong and London. We have been in business since 2014 after successfully spinning off from a major New York-based hedge fund. Currently we have about 85 full time employees and manage approximately US$3.6 billion of capital.</p>\n\n<p>We seek to engage in intelligent risk-taking to create value for our clients, partners and employees.</p>\n\n<p>We derive our edge from our capacity to generate Win-Wins ­ in the broadest sense. Win-Win is our fundamental ethical and strategic principle. By generating Win-Wins, we can create unique solutions that reconcile perspectives that are usually seen as incompatible or opposites, and\nencompass the best that each side has to offer.</p>\n\n<p>We integrate fixed-income arbitrage with global macro strategies in a novel way.  We invent and develop technology that focuses on the <a href=\"http://queue.acm.org/detail.cfm?id=2841313\">potential of human-machine integration</a>.  We build systems where <a href=\"https://www.wired.com/2017/04/the-myth-of-a-superhuman-ai/\">machines do what they do best,</a> supporting <a href=\"https://www.kitchensoap.com/2012/09/21/a-mature-role-for-automation-part-i/\">people to do what people do best</a>.</p>\n\n<p>We are creating a collaborative meritocracy: a culture where individual contribution serves both personal and collective goals - and is rewarded accordingly.  We value both ownership thinking AND cooperative team spirit, self-realization AND community.</p>\n\n<p><strong>Careers at Symmetry</strong></p>\n\n<p>At Symmetry we believe that man-machine integration is not only the question at the <a href=\"https://www.quora.com/Are-hedge-fund-jobs-going-to-be-automated-away\">heart of future competitiveness in the markets</a> but also of <a href=\"https://www.cumberlandlodge.ac.uk/learning-resources/are-we-turning-ourselves-machines-lecture-report\">crucial importance for society as a whole</a>. We are  interested in candidates who are inspired and excited by the challenge of participating in developing a new approach at the leading edge.</p>\n\n<p>We are looking for solution-oriented people who raise problems when they see them, and take the initiative in working with the right people across the firm to solve them.  We like people who are capable of letting a problem simmer when needed - and are able to tolerate uncertainty until all pieces of the puzzle fall into place.</p>\n\n<p>We support individualists who have an inner need to excel at what they do and are capable of, and value, collaborative work.  We appreciate rare talent that, because of its uniqueness, might be undervalued in a more conventional corporate setting.  </p>\n\n<p>For the right fit, we commit to our employees by creating Win-Wins with their own long term aspirations.</p>\n\n<p><strong>Requirements</strong></p>\n\n<p><strong>We are looking for mature hackers with a moral compass and sense of responsibility who have kept their imaginativeness. We value interest and capabilities as much as formal experience. Academic credentials are not a requirement if you can demonstrate outstanding capabilities that fit the role</strong>.</p>\n\n<p>Our infrastructure is a mix of Windows and Linux and ideally you are comfortable with a devops approach to both: happy to manage the Windows infrastructure in the UNIX spirit yet making pragmatic decisions about purchasing vs building tools yourself.</p>\n\n<p>You will be working in a creative, often less-structured environment, with a high degree of autonomy to implement solutions. You are comfortable asking for help when you need it.  You are capable of accepting direction should a particular solution fit with the longer-term strategic goals of the firm.</p>\n\n<p>You are able to communicate both at the level of ideas and concretely either in writing or in person/by telephone.  The ability to be diplomatic is valuable, but not absolutely required.</p>\n\n<p>You have a pragmatic devotion to excellence: the ability to recognize and evaluate interim solutions, while not being satisfied about retaining a hack in the long run.</p>\n\n<p>You are able to think about problems in a generic, high-level way AND pragmatically use common sense. You can think associatively and hold a complex mental picture in your head as well as sequentially.</p>\n\n<p>An intuitive understanding of hardware, networks and/or low-level programming is a positive.</p>\n\n<p>An interest in infosec is a must. You have the ability to think about it from an adversary's perspective rather than simply lagging 'best practices'.</p>\n\n<p>You have the ability to design and use scripts and tools to monitor developments and risks and to probe our systems for vulnerabilities.   You also show an awareness of developments in the security research community, and the ability to apply insights to our business.</p>\n\n<p>An ability to think clearly and to act decisively in occasional high-pressure moments is desirable.</p>\n\n<p><strong>Skills</strong></p>\n\n<p>The right person will be able to learn what they need to perform the role, and of course we will provide whatever resources are required to support the development of an employee.</p>\n\n<p>Knowledge of the below will be helpful.</p>\n\n<ul>\n<li><p>Platform: Linux (Arch/Debian); Windows 10/Server 2016; Illumos/SmartOS (under consideration)</p></li>\n<li><p>Network: Infiniband, 10BaseT</p></li>\n<li><p>Storage: ZFS on Linux/FreeBSD/Solarish; Weka.io (under consideration)</p></li>\n<li><p>Containers/VM: LXC/LXD; KVM/Libvirt; Solaris LX Branded Zones/vSphere/Windows containers  (under consideration)</p></li>\n<li><p>Monitoring/Instrumenting: Graylog, Telegraf/Grafana using Etsy's statsd; custom scripting</p></li>\n<li><p>Databases etc: InfluxDB; Postgres; MS SQL; Mongo; ElasticSearch</p></li>\n<li><p>Email: Exchange (legacy); Dovecot/Postfix + stack (under consideration)</p></li>\n<li><p>Applications: GitLab, Win office desktops; proprietary/commercial financial</p></li>\n<li><p>Scripting: Python, D, zsh, Go, Lua, C#, Powershell</p></li>\n<li><p>Configuration Management: Packer; Chocolatey; Salt Stack; Chef; Vagrant; Terraform/Vault/Consul/Nomad (under consideration)</p></li>\n<li><p>Cloud: DigitalOcean, rented bare-metal (eg SoftLayer)</p></li>\n</ul><p>Nitty-gritty technical knowledge of the working of Windows desktop/server and Linux sysadmin skills helpful.  If you can read and write C and aren't afraid of hardware, that's a bonus, but you should certainly be highly proficient in at least one programming language, and you should be comfortable with a kaizen approach to testing and deployment.</p>\n\n<p><strong>Applying</strong> </p>\n\n<p>If this sounds a little like you, please get in touch - we would be delighted to hear from you.  Send a letter explaining why you are interested in the role, and what makes you suitable for it along with a CV or bio to: <a href=\"mailto:devops.hiring@symmetryinvestments.io\">devops.hiring@symmetryinvestments.io</a></p>\n\n<p>Make sure to <strong>mention and provide links to any open-source projects</strong> or activities you have been involved with.</p>","how_to_apply":"<p>Email your resume with cover letter explaining your interest in the job and what you can bring to <a href=\"mailto:devops.hiring@symmetryinvestments.io\"><strong>devops.hiring@symmetryinvestments.io</strong></a>.</p>\n\n<p>Include links to your GitHub repository, technical blog, or similar.</p>","company":"Symmetry Investments","company_url":"http://symmetryinvestments.com","company_logo":"http://github-jobs.s3.amazonaws.com/f267137a-b4f2-11e7-8db2-6149ada71871.png","url":"http://jobs.github.com/positions/8e98eac8-b504-11e7-9da8-0737a3dcef18"},{"id":"d6e3953a-b42d-11e7-87bf-9a66ae04893d","created_at":"Wed Oct 18 17:58:35 UTC 2017","title":"Data Engineer","location":"San Francisco or Remote","type":"Full Time","description":"<p>Doximity is rewiring healthcare and is the 6th fastest-growing technology company in North America ( <a href=\"http://www.prnewswire.com/news-releases/doximity-is-fastest-growing-company-in-bay-area-per-deloittes-2016-technology-fast-500-300367390.html\">http://www.prnewswire.com/news-releases/doximity-is-fastest-growing-company-in-bay-area-per-deloittes-2016-technology-fast-500-300367390.html</a> ). Here's how clinicians use our products. ( <a href=\"https://res.cloudinary.com/dhttas9u5/image/upload/WhyDocsUseDox-Infographic_20160930_adpvj6.pdf\">https://res.cloudinary.com/dhttas9u5/image/upload/WhyDocsUseDox-Infographic_20160930_adpvj6.pdf</a> ) For us, transparency is key. Ensuring your goals and values align with ours is also an important step. Take a look at how we Work at Doximity. ( <a href=\"https://workat.doximity.com/\">https://workat.doximity.com/</a> )</p>\n\n<p>You will join a small team of data infrastructure engineers (4) to build and maintain all aspects of our data pipelines, ETL processes, data warehousing, ingestion and overall data infrastructure. We have one of the richest healthcare datasets in the world, and we're not afraid to invest in all things data to enhance our ability to extract insight.</p>\n\n<p>What You'll Work On</p>\n\n<ul>\n<li>Help establish robust solutions for consolidating data from a variety of data sources. </li>\n<li>Collaborate with product managers and data scientists to architect pipelines to support delivery of recommendations and insights from machine learning models. </li>\n<li>Build and maintain efficient data integration, matching, and ingestion pipelines. </li>\n<li>Establish data architecture processes and practices that can be scheduled, automated, replicated and serve as standards for other teams to leverage. </li>\n<li>Build instrumentation, alerting and error-recovery system for the entire data infrastructure. </li>\n<li>Spearhead, plan and carry out the implementation of solutions while self-managing. </li>\n<li>We expect you to be very comfortable around Unix, Git, and AWS.</li>\n</ul><p>Must Have Skills &amp; Requirements</p>\n\n<ul>\n<li>At least three years of professional experience developing data infrastructure solutions. </li>\n<li>Fluency in Python and SQL. </li>\n<li>Experience building data pipelines with Spark and Kafka. </li>\n<li>Passion for clean code and testing with Pytest, FactoryBoy, or equivalent. </li>\n<li>Comprehensive experience with Unix, Git, and AWS tooling. </li>\n<li>Astute ability to self-manage, prioritize, and deliver functional solutions.</li>\n</ul><p>Nice to Have Skills &amp; Requirements</p>\n\n<ul>\n<li>Experience with MySQL replication, binary logs, and log shipping. </li>\n<li>Experience with additional technologies such as Hive, EMR, Presto or similar technologies. </li>\n<li>Experience with MPP databases such as Redshift and working with both normalized and denormalized data models. </li>\n<li>Knowledge of data design principles and experience using ETL frameworks such as Sqoop or equivalent. </li>\n<li>Experience designing, implementing and scheduling data pipelines on workflow tools like Airflow, or equivalent. </li>\n<li>Experience working with Docker, PyCharm, Neo4j, Elasticsearch, or equivalent.</li>\n</ul><p>Our Data Stack</p>\n\n<ul>\n<li>Python, Kafka, Spark, MySQL, Redshift, Presto, Airflow, Neo4j, Elasticsearch</li>\n</ul><p>Fun Facts About the Team</p>\n\n<ul>\n<li>We have access to one of the richest healthcare datasets in the world, with deep information on hundreds of thousands of healthcare professionals and their connections. </li>\n<li>Business decisions at Doximity are driven by our data, analyses, and insights. </li>\n<li>Hundreds of thousands of healthcare professionals will utilize the products you build. </li>\n<li>Our R&amp;D team makes up about half the company, and the product is led by the R&amp;D team. </li>\n<li>Our Data Science team is comprised of about 20 people.</li>\n</ul><p>Benefits &amp; Perks</p>\n\n<ul>\n<li>Comprehensive benefits including medical, vision, dental, Life/ADD, 401k, flex spending accounts, and commuter benefits </li>\n<li>Stock, pre-IPO stock incentives </li>\n<li>Work from home Wednesdays (for HQ employees) </li>\n<li>3+ weeks of PTO </li>\n<li>12 company holidays, including company shut-down in December </li>\n<li>Fully ergonomic setup in HQ </li>\n<li>Free lunch, snacks, and beverages in HQ </li>\n<li>Rooftop game room and deck with a beautiful view of SF skyline in HQ </li>\n<li>Team trips to fun places like Lake Tahoe, Sonoma, Seattle and Park City </li>\n<li>5th-year sabbatical</li>\n</ul><p>About Doximity</p>\n\n<p>Doximity is the leading social network for healthcare professionals with over 75% of U.S. doctors as members. We have strong revenues, profits, real market traction, and were putting a dent in the inefficiencies of our $2.5 trillion U.S. healthcare system. After the iPhone, Doximity is the fastest adopted product by doctors of all time. Our founder, Jeff Tangney, is the founder &amp; former President and COO of Epocrates (IPO in 2010), and Nate Gross is the founder of digital health accelerator RockHealth. Our investors include top venture capital firms who've invested in Box, Salesforce, Skype, SpaceX, Tesla Motors, Twitter, Tumblr, Mulesoft, and Yammer. Our beautiful offices are located in SoMa San Francisco.</p>\n\n<p>We are an equal opportunity employer and value diversity at our company. We do not discriminate by race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</p>","how_to_apply":"<p><a href=\"http://grnh.se/5ocetf1\">http://grnh.se/5ocetf1</a></p>","company":"Doximity","company_url":"http://engineering.doximity.com","company_logo":null,"url":"http://jobs.github.com/positions/d6e3953a-b42d-11e7-87bf-9a66ae04893d"},{"id":"8d597e0a-76ea-11e7-89e1-fd7faf0f62b7","created_at":"Tue Oct 17 21:29:22 UTC 2017","title":"Senior DevOps Engineer (Full Time/Salary)","location":"New York City (Midtown)","type":"Full Time","description":"<p><strong>WHO WE ARE:</strong></p>\n\n<p>Slingshot Health is an online marketplace that allows users to connect directly with healthcare\nproviders for services. Created by real doctors, Slingshot Health aims to put both consumers and\nproviders back in control of their own everyday care without the red tape of the existing system.\nOur two core values, humility and loving kindness, are at the foundation of all of our operations.\nWe are a strong team striving for a high standard of excellence. We hire primary thinkers and\ntrust them to get the job done. As a fast growing startup, gaining more and more momentum by\nthe day, we expect team members to be innovative, trustworthy and responsible, adaptive to\nchange, and ambitious.\nIf our environment for radical candor and big problem solving is exciting and appealing to you,\nwe’re sure you’ll fit in.</p>\n\n<p><strong>DESCRIPTION:</strong></p>\n\n<p>As a Senior DevOps Engineer you will work with an agile team of developers, product owners\nand designers. You will contribute daily to the vision of the product through a well thought out\nproduct backlog. You will play a key role in our process to improve the efficiency of our software\noperations. You will share the responsibility of keeping our continuous integration deployment\nprocess on the cutting edge utilizing the latest methods available. You will own the deployment\nprocess and shape it with your current knowledge, while still learning new techniques from team\nmembers and other resources.</p>\n\n<p><strong>PREFERED SKILLS:</strong></p>\n\n<ul>\n<li>Continuous integration</li>\n<li>Docker</li>\n<li>Amazon Web Services</li>\n<li>Load balancing &amp; A/B Testing</li>\n<li>PostgreSQL</li>\n<li>Bash</li>\n<li>Python</li>\n<li>Redis</li>\n<li>Git</li>\n</ul><p><strong>NICE TO HAVE:</strong></p>\n\n<ul>\n<li>Jira</li>\n<li>Agile Methodologies</li>\n<li>Basic backend and/or frontend knowledge</li>\n</ul>","how_to_apply":"<p>Email us at <a href=\"mailto:tech+github@slingshothealth.com\">tech+github@slingshothealth.com</a></p>","company":"SlingshotHealth","company_url":"http://www.slingshothealth.com","company_logo":"http://github-jobs.s3.amazonaws.com/25a94144-b382-11e7-885c-043488f6cb14.png","url":"http://jobs.github.com/positions/8d597e0a-76ea-11e7-89e1-fd7faf0f62b7"},{"id":"cd964f1e-5c07-11e7-98db-e2ee25ba5947","created_at":"Tue Oct 17 21:27:04 UTC 2017","title":"Senior Back End Developer (Full Time/Salary)","location":"New York City (Midtown)","type":"Full Time","description":"<p><strong>WHO WE ARE:</strong></p>\n\n<p>Slingshot Health is an online marketplace that allows users to connect directly with healthcare\nproviders for services. Created by real doctors, Slingshot Health aims to put both consumers and\nproviders back in control of their own everyday care without the red tape of the existing system.\nOur two core values, humility and loving kindness, are at the foundation of all of our operations.\nWe are a strong team striving for a high standard of excellence. We hire primary thinkers and\ntrust them to get the job done. As a fast growing startup, gaining more and more momentum by\nthe day, we expect team members to be innovative, trustworthy and responsible, adaptive to\nchange, and ambitious.</p>\n\n<p>If our environment for radical candor and big problem solving is exciting and appealing to you,\nwe’re sure you’ll fit in.</p>\n\n<p><strong>DESCRIPTION:</strong></p>\n\n<p>As a Senior Back End Developer you will work on our restful API with an agile team of\ndevelopers, product owners and designers. You will own the projects you work on and shape\nthem with your current knowledge. You will also have the opportunity to contribute daily to the\nvision of the product through a well thought out product backlog. Your day to day will involve\nhands on problem solving, devops, sprint planning, code reviews, writing model and request API\ntests, email queuing, third party integrations, and database management.</p>\n\n<p><strong>PREFERED SKILLS:</strong></p>\n\n<ul>\n<li>3+ years backend experience</li>\n<li>Python / Django</li>\n<li>Restful APIs</li>\n<li>PostgreSQL</li>\n<li>Redis</li>\n<li>uWSGI</li>\n<li>Amazon Web Services</li>\n<li>Docker</li>\n<li>Git</li>\n<li>Load balancing &amp; A/B Testing</li>\n</ul><p><strong>NICE TO HAVE:</strong></p>\n\n<ul>\n<li>Jira</li>\n<li>Experience with frontend technologies and frameworks</li>\n<li>Google Analytics</li>\n<li>Agile Methodologies</li>\n</ul>","how_to_apply":"<p><a href=\"mailto:tech+github@slingshothealth.com\">tech+github@slingshothealth.com</a></p>","company":"SlingshotHealth","company_url":"http://www.slingshothealth.com","company_logo":"http://github-jobs.s3.amazonaws.com/ba92ca88-b381-11e7-9b0d-6e6809da8c96.png","url":"http://jobs.github.com/positions/cd964f1e-5c07-11e7-98db-e2ee25ba5947"},{"id":"05d71990-3cd6-11e7-85ac-ed44b4959fad","created_at":"Tue Oct 17 20:59:17 UTC 2017","title":"MySQL Architect","location":"Alpharetta","type":"Full Time","description":"<p>Unlock Your Career Potential: Technology at ADP. Do you enjoy exploring, identifying and inspiring the future of the workplace and the lives of millions of people? At ADP, the world's largest B2B cloud company, our Technology team is comprised of brilliant engineers, architects, data scientists, infrastructure experts, and more. We were first in our industry to offer a SaaS solution and continue to push the envelope utilizing the latest operating platforms to deliver the highly automated, intelligent and predictive solutions that are redefining what is possible. Named one of Forbes' \"Most Innovative Companies\" and one of Computerworld's \"100 Best Places to Work in IT\", we are committed to leading the way in product development and research, empowering you to bring to life the latest innovations that will forever change the way businesses manage their most vital asset, employees.  </p>\n\n<p>Join ADP's innovation lab as we undertake one of ADP's most ambitious transformation initiatives ever. We're building a team from of the most elite, game-changing technologists and asking them to reinvent the way millions of employees are paid worldwide. If you are a sharp, self-driven product manager who is passionate about solving really big problems, we want to talk to you.  </p>\n\n<p>5+ years working with MySQL on LINUX and Cloud  </p>\n\n<p>Experience and knowledge of:</p>\n\n<ul>\n<li><p>MySQL</p></li>\n<li><p>Optimization</p></li>\n<li><p>Replication</p></li>\n<li><p>Performance Tuning</p></li>\n<li><p>Clustering</p></li>\n<li><p>MySQL internals</p></li>\n<li><p>5+ years of experience administering MySQL replication, configuration, and deployment strategies</p></li>\n<li><p>Strong Knowledge with database architecture design, including data partitioning and application partitioning</p></li>\n<li><p>Strong understanding of distributed systems, different levels of data consistency, CAP theorem</p></li>\n<li><p>Expert knowledge in maintaining, building, supporting, tuning, and monitoring production in MySQL database servers.</p></li>\n<li><p>Must be highly proficient in all aspects of database administration, including backup/recovery/replication, clustering, advanced performance tuning, and proactive monitoring</p></li>\n<li><p>Understand data locking concepts and the different levels of locking in MySQL</p></li>\n<li><p>Familiarity with Cassandra, MongoDB or other NOSQL persistence systems</p></li>\n<li><p>Strong scripting experience (shell, Python, etc)</p></li>\n</ul><p>Preferred:  </p>\n\n<ul>\n<li>Expertise in cloud hosted infrastructure on public clouds (AWS, Azure, Google Cloud etc)<br>\n</li>\n<li>Experience with infrastructure as code design, implementation and tools such as Ansible, Terraform, DSC etc.</li>\n</ul>","how_to_apply":"<p>How to Apply: <a href=\"http://bit.ly/2nNrWMl\">http://bit.ly/2nNrWMl</a></p>","company":"ADP","company_url":"http://www.adp.com","company_logo":"http://github-jobs.s3.amazonaws.com/017fa18c-3cd6-11e7-910b-996d91dbc14f.png","url":"http://jobs.github.com/positions/05d71990-3cd6-11e7-85ac-ed44b4959fad"},{"id":"3ce0c898-520f-11e7-9591-e1727e331916","created_at":"Tue Oct 17 20:59:17 UTC 2017","title":"Manager/Director of Strategic Workforce Planning","location":"Roseland, NJ","type":"Full Time","description":"<p>ADP is hiring a Manager or Director, Strategic Workforce Planning. This individual will be responsible for enhancing ADP's capability and approach to Strategic Workforce Planning (SWP); resulting in clear plans for ensuring that ADP has the talent needed to achieve its long-term business strategy. This professional will play an integral role in the implementation, adoption, and enhancement of ADP's methodology and approach to Strategic Workforce Planning. This position will contribute to SWP activity by providing analytical expertise to improve decision making through the use of advanced workforce planning techniques and tools.</p>\n\n<p>At ADP we are driven by your success. We engage your unique talents and perspectives. We welcome your ideas on how to do things differently and better. In your efforts to achieve, learn and grow, we support you all the way. If success motivates you, you belong at ADP.</p>\n\n<p>We strive for every interaction to be driven by our CORE values: Insightful Expertise, Integrity is Everything, Service Excellence, Inspiring Innovation, Each Person Counts, Results-Driven, &amp; Social Responsibility.</p>\n\n<p>RESPONSIBILITIES:</p>\n\n<ul>\n<li>Lead complex analyses to forecast workforce needs and requirements that will contribute to the development of long-term talent strategies</li>\n<li>Gather, analyze, and share internal and external data to identify economic trends, demographic shifts, and capabilities that will impact the demand and supply of talent</li>\n<li>Apply advanced workforce planning techniques and tools (e.g., scenario modeling/planning, supply and demand forecasting, trend analysis, predictive modeling) to provide insight and recommendations on workforce plans</li>\n<li>Contribute to the evaluation of the effectiveness of SWP activity by establishing and maintaining core SWP metrics and relevant scorecards/tracking tools</li>\n<li>Contribute to enterprise-wide talent strategy development by reviewing BU/Function plans to identify common themes across ADP (e.g., shared needs, gaps, and solutions)</li>\n<li>Identify, recommend, and develop enhancements to ADP's SWP process, methodology, and tools</li>\n<li>Actively cultivate an SWP community of practice to build broad SWP capability in HR</li>\n<li>Lead special research projects, as appropriate, to build a deep understanding of ADP's workforce</li>\n<li>Provide analytical expertise and support to other Global Talent &amp; Learning practices and processes (e.g., Annual Talent Review, Competency Assessments)</li>\n</ul><p>EDUCATION/CERTIFICATION:</p>\n\n<ul>\n<li>Degree within a quantitative discipline (e.g., statistics, finance, economics, data science, industrial/organizational psychology); Master's degree strongly preferred</li>\n</ul><p>EXPERIENCE:</p>\n\n<ul>\n<li>3+ years of experience within the workforce and/or business planning discipline, including direct experience with HCM metrics, benchmarking, data analysis, predictive modeling, headcount forecasting/budgeting</li>\n<li>Demonstrated expertise in creating and leveraging trend analyses and scenario models</li>\n<li>Experience with the development of long-term headcount forecasts based on multiple data sources (e.g., financial, HR)</li>\n<li>Expertise in creating a comprehensive workforce story by aggregating and analyzing data collected from various HR, Finance, and Business functions/systems</li>\n<li>Demonstrated use of large data sets and statistical software (e.g., python, SAS, R) to facilitate decision making</li>\n<li>Experience working with a forecasting software tool is a plus</li>\n</ul><p>SKILLS:</p>\n\n<ul>\n<li>Ability to connect internal and external workforce information, especially researching best practices and relevant global labor market data</li>\n<li>Ability to understand and interpret the implications of business and financial plans on human capital needs</li>\n<li>Advanced knowledge and expertise with relevant statistical software (e.g., python, SAS, R) and Microsoft Office products (e.g., Excel, Access, PowerPoint)</li>\n<li>Expertise in the development and utilization of predictive analytics and statistical modeling</li>\n<li>Ability to translate workforce analytics into compelling insights and actionable recommendations</li>\n<li>Executive presence; quickly establishes credibility as a trusted business advisor</li>\n<li>Able to collaborate and align resources and efforts effectively across organization lines to accomplish results</li>\n<li>Excellent communication skills (written and verbal) and ability to communicate complex concepts in a clear and practical way</li>\n<li>Strong consulting skills with an ability to evaluate among a wide variety of solutions</li>\n<li>Highly collaborative working style</li>\n<li>Global perspective (knowledge and understanding of US and non-US environments)</li>\n</ul>","how_to_apply":"<p>Please go to our career site <a href=\"http://www.adp.com/careers\">www.adp.com/career</a> and search for req number 133137</p>","company":"ADP","company_url":"http://www.adp.com","company_logo":"http://github-jobs.s3.amazonaws.com/4f898480-520f-11e7-997e-87cc925ca349.png","url":"http://jobs.github.com/positions/3ce0c898-520f-11e7-9591-e1727e331916"},{"id":"b5d01f14-b36d-11e7-9b26-59f11a71eb6f","created_at":"Tue Oct 17 20:04:49 UTC 2017","title":"Sr. Full Stack Developer (Ruby, PostgreSQL)","location":"Houston, TX ","type":"Full Time","description":"<p>As a <strong>Full Stack Developer</strong> at Onit, you will help design, develop, and implement new modules and APIs for the Onit App Builder. Currently, we use Ruby on Rails, React, JavaScript, jQuery, ExtJS, MySQL, and MongoDB. We are an agile software development shop, and believe in automated testing. If you’re a good fit, you will be able to master any technology, language, or development environment that we need in the future.</p>\n\n<p><strong>Responsibilities:</strong></p>\n\n<ul>\n<li>Plan, build and launch features for our products</li>\n<li>Work closely with our designers and project management team to craft well thought out user experiences</li>\n<li>Estimate development tasks and meet deadlines</li>\n</ul><p><strong>Skills/Qualifications:</strong></p>\n\n<ul>\n<li>Degree in Computer Science/Electrical Engineering/Physics or other similar disciplines is preferred</li>\n<li>\n<strong>5+  years of experience</strong> using current language(s) for web development</li>\n<li>Demonstrated proficiency in at least two of the languages listed: <strong>Ruby on Rails</strong> / Java / Python / JavaScript / React</li>\n<li>Experienced with <strong>PostgreSQL</strong> is highly preferred </li>\n<li>Experienced in UI development</li>\n<li>Demonstrated full cycle development leveraging Agile methodologies</li>\n<li>Ability to work and develop in Mac/Linux environment</li>\n</ul><p><strong>How to apply</strong></p>\n\n<ul>\n<li>Resumes must be in a PDF or MS Word format.</li>\n</ul><p>Onit is on the move and we are closing new deals.  The company is climbing the Inc. 500 list and we are seeking to expand our teams in Houston &amp; Austin with bright, out of the box thinkers! Its time to make the move to work in a collaborative environment that fosters innovation.  Join us at Onit! </p>\n\n<p>About Onit, Inc.</p>\n\n<p><strong>This is a fun and collaborative office to work in! We have a very casual dress code, offer our employees awesome benefits, full stacked snack bars and weekly lunches catered in the office.</strong></p>\n\n<ul>\n<li>At this time, we will be able to provide partial relocation assistance for non-local candidates. </li>\n<li>Position will require you to work on-site. This not a remote opportunity. </li>\n<li>This is not a part time position. </li>\n<li>We will not do Corp-to-Corp for this role</li>\n<li>This is a W2 position based in Houston, TX </li>\n</ul><p>Onit was formed by legal software industry experts Eric M. Elfman and Eric A. Smith, co-founders of Datacert, a leading provider of enterprise spend management software. Launched in early 2011, Onit deploys Onit Apps to simplify business process automation and improve business productivity across all departments and industries. Onit App Builder allows business users to drive efficiency and productivity by combining business process management, project management and information management into one easy to use tool so the user can create their own Onit Apps without having to rely on IT for support.</p>\n\n<p>Businesses have processes for everything -- whether it’s hiring a vendor or law firm, terminating an employee, submitting a contract for review, requesting a trademark request, obtaining an NDA, etc. Most of these processes are manual, paper intensive and cumbersome. With Onit Apps, processes are automated in a few clicks, responsible parties are notified immediately, and data collection is centralized. Onit doesn’t require any software to download or resources from IT.</p>\n\n<p><a href=\"http://www.onit.com\">Click here to visit our website</a></p>","how_to_apply":"<p>Send your resume to:  <a href=\"mailto:careers@onit.com\">careers@onit.com</a></p>","company":"Onit","company_url":"http://Onit","company_logo":"http://github-jobs.s3.amazonaws.com/2f6ca2c2-b36c-11e7-8f7a-048eaf214465.png","url":"http://jobs.github.com/positions/b5d01f14-b36d-11e7-9b26-59f11a71eb6f"},{"id":"6015745e-b339-11e7-8b44-fa2a9f837ed0","created_at":"Tue Oct 17 12:48:49 UTC 2017","title":"Senior Business Intelligence Developer","location":"Basel, Switzerland","type":"Full Time","description":"<p>The Bank for International Settlements is an inter­national organisation which fosters international monetary and financial cooperation via wide-ranging banking, economic research and policy coordination activities via wide-ranging banking, economic research and policy coordination activities.</p>\n\n<p>Office location: <strong>Basel</strong> </p>\n\n<p>Application Deadline: <strong>12/11/2017</strong></p>\n\n<p>The BIS is recruiting for a Senior Developer specialising in Business Intelligence (BI) to join the Platform Engineering IT team, responsible for the development of data management platforms at the BIS. You have extensive knowledge of Microsoft SQL Server tools, including SQL Server Integration Services and SQL Server Analysis Services (both tabular and multi-dimensional models), and of concepts such as dimensional modelling, data vault and analytic database design. You are experienced in supervising external developers and managing projects, are flexible and work collaboratively, and you enjoy the challenge of working in a complex, multi-cultural environment.</p>\n\n<p><strong>Key responsibilities:</strong></p>\n\n<ul>\n<li>Design and implement the platform for delivering business intelligence and advanced analytics</li>\n<li>Translate business requirements into technical specifications</li>\n<li>Carry out logical and physical data modelling to support data analytics and reporting applications</li>\n<li>Oversee the development lifecycle for data management components</li>\n<li>Provide support for production systems</li>\n<li>Work with the Enterprise Architect and senior IT staff to develop the data management strategy</li>\n</ul><p><strong>Qualifications, skills and experience:</strong></p>\n\n<ul>\n<li>University degree in computer science or a related discipline</li>\n<li>At least eight years' experience in systems analysis and design using the Microsoft SQL Server Business Intelligence toolset, especially Integration Services and SQL Server Analysis Service (SSAS) Management Services</li>\n<li>At least five years' experience working in data warehousing or BI projects with experience in data warehousing design, data vault modelling, (including dimensional modelling), physical design, data quality and ETL</li>\n<li>Experience with automation tools (Biml, NBI etc) and in managing build / releases an advantage</li>\n<li>Experience developing, implementing and coordinating data governance activities</li>\n<li>Experience working in the financial sector would be an advantage</li>\n<li>Understanding of NoSQL and Big Data technologies and knowledge in data science concepts, machine learning and programming language such as R and Python would be an advantage</li>\n<li>Strong problem-solving and root cause analysis approach</li>\n<li>Highly service-oriented and proactive; able to perform under pressure</li>\n<li>Strong team player, able to work in a cross-departmental IT team</li>\n<li>Excellent communication skills with fluent English (oral and written); additional languages desirable</li>\n</ul><p><em>The BIS's head office is located in Basel, Switzerland, with representative offices in Hong Kong SAR and Mexico City. We are able to recruit globally, regardless of nationality, and offer competitive employment packages. The BIS employs staff on both open-ended and fixed-term contracts. However, all new entrants are initially recruited on a fixed-term basis. The BIS is fully committed to equal opportunity employment and strives for diversity among its staff. We encourage applications from female candidates.</em></p>","how_to_apply":"<p><a href=\"https://jobstats.robopost.com/count/clic.php?v=100791&amp;j=1994\">https://jobstats.robopost.com/count/clic.php?v=100791&amp;j=1994</a></p>","company":"The Bank for International Settlements (BIS)","company_url":"https://www.bis.org/index.htm","company_logo":"http://github-jobs.s3.amazonaws.com/2a94e6d4-b339-11e7-859d-064419db76e2.gif","url":"http://jobs.github.com/positions/6015745e-b339-11e7-8b44-fa2a9f837ed0"},{"id":"39d620aa-b2ac-11e7-8a85-2d6d6148fc06","created_at":"Mon Oct 16 19:57:44 UTC 2017","title":"Software Engineer, Discovery Research (BS/MS) (ABT00001740)","location":"Johnston, IA","type":"Full Time","description":"<p>DuPont has a rich history of scientific discovery that has enabled countless innovations and today, we're looking for more people, in more places, to collaborate with us to make life the best that it can be. DuPont Pioneer is the world’s leading developer and supplier of advanced plant genetics to farmers in more than 90 countries. Our mission to feed the world is based on and enabled by world class science and multi-disciplinary research which is conducted by more than 1,000 researchers world-wide. For our growing efforts in imaging sciences we are looking for a qualified  Software Engineer in the area of image analysis software deployment. </p>\n\n<p>Duties &amp; Responsibilities:\nInteract closely with imaging specialists, data scientists, and automation engineers to design and deploy sophisticated analysis pipelines and rich, modern web and iOS interfaces for image-based phenotyping in laboratories, controlled environments (greenhouses), and in field trials (remote sensing and satellite imagery) to enable biotechnology and plant breeding research.   Solutions will be deployed both on-premise and in Amazon Web Services.</p>\n\n<p>Qualifications &amp; Experience:</p>\n\n<ul>\n<li>Bachelors degree in computer science or a related field preferred and 3-5 years of experience with software engineering and testing experience required.</li>\n<li>Expertise in Python programming and Test-Driven Development. Demonstrated knowledge of at least one Python-based web framework: one of Flask, Django, or Pyramid. Knowledge of async libraries (like Python3's asyncio or Tornado) a plus.</li>\n<li>Good knowledge of at least one Relational Database System (Postgres preferred) and at least one NoSQL system: Cassandra (preferred) or MongoDB.</li>\n<li>Strong knowledge of Linux and UNIX-like systems. Demonstrated ability in building applications via the commandline, debugging issues, and performing minor administrative tasks as necessary.</li>\n<li>Proficiency with shell-scripting and common UNIX CLI tools (e.g. sed, awk, and grep)</li>\n<li>Experience with frontend technologies. HTML5, CSS3, and good knowledge of at least one Javascript framework (AngularJS or React preferred.) Must be familiar with at least one build tool (like Gulp or Webpack) and testing framework (like Mocha or Jasmine.)</li>\n<li>Deep knowledge of RESTful principles and RESTful API design and documentation using tools like Swagger or RAML (preferred).</li>\n<li>Experience with git and employing CI/CD systems for automated deployments on-premise and in AWS.</li>\n<li>Interest in learning new technologies, programming methodologies, and languages is a must.</li>\n<li>Strong verbal and written communication skills in English are required.</li>\n</ul><p>Preferred Qualifications:</p>\n\n<ul>\n<li>A Github portfolio.</li>\n<li>Experience with CI/CD and imaging libraries like OpenCV.</li>\n<li>Experience in research, life sciences, or in data science.</li>\n<li>Experience with Objective C/iOS development.</li>\n<li>Proven ability to develop and deploy applications on Amazon Web Services. While the certificate itself is not necessary, must be able to pass the AWS Developer Associate certification exam.</li>\n<li>Experience with app containerization using Docker, and deployment on platforms like Kubernetes or ECS.</li>\n</ul><p>Apply online at: <a href=\"http://careers.dupont.com/jobsearch/job-details/software-engineer-discovery-research-bsms/ABT00001740/413362/\">http://careers.dupont.com/jobsearch/job-details/software-engineer-discovery-research-bsms/ABT00001740/413362/</a></p>","how_to_apply":"<p>Apply online at: <a href=\"http://careers.dupont.com/jobsearch/job-details/software-engineer-discovery-research-bsms/ABT00001740/413362/\">http://careers.dupont.com/jobsearch/job-details/software-engineer-discovery-research-bsms/ABT00001740/413362/</a></p>","company":"DuPont Pioneer","company_url":"http://careers.dupont.com/jobsearch/job-details/software-engineer-discovery-research-bsms/ABT00001740/413362/","company_logo":"http://github-jobs.s3.amazonaws.com/33c879ec-b2ac-11e7-9669-155f688bee88.jpg","url":"http://jobs.github.com/positions/39d620aa-b2ac-11e7-8a85-2d6d6148fc06"},{"id":"a1d5d91e-b28b-11e7-84f8-398e4f3969a8","created_at":"Mon Oct 16 16:04:38 UTC 2017","title":"Senior QA Engineer - Performance Testing","location":"Waltham, MA","type":"Full Time","description":"<p>Do you thrive in a results oriented, fast-paced, intense working environment where the discoveries you make mean making the next generation of software better?  Performance and scale are key to our product offerings. You’ll have direct, immediate impact on our product quality goals and success. </p>\n\n<p>We are looking for a Senior QA Engineer - Performance Testing who will be a part of a cross-product Performance and Scale team responsible for the definition, design, implementation and maintenance of complex test environments both in the cloud and on–prem, aiming to replicate real-world customer environments and execution workloads.</p>\n\n<p>What You’ll Do</p>\n\n<p>Maintain, enhance, and redesign environments, processes, and tools for cross-product Performance and Scale testing\nWork within QA partnering with the Automation Teams and Release Engineering to:\nDevelop and publish appropriate metrics to demonstrate performance and operational efficiency.\nRun, update and maintain performance tests\nIn collaboration with your teammates, design and execute on the cross-product Performance and Scale roadmap\nWork cross-functionally with various teams to drive amazing results.</p>\n\n<p>What You’ll Bring</p>\n\n<p>7+ years of experience in systems testing, particularly performance testing of enterprise-class applications\nSolid understanding of Windows, Mac, an Linux operating systems, including capability to build and configure systems\nGeneral knowledge of Jenkins\nWell versed in Shell scripting\nBasic experience with Python\nKnowledge of Git/GitHub and SVN source control\nExperience with AWS Cloud\nExperience with JIRA, and Confluence is a plus</p>\n\n<p>Preferred experience:</p>\n\n<p>Experience with performance testing methodologies and also test scripting/automation\nExperience with tuning, benchmarking and troubleshooting software configurations and an understanding of deployment environment issues and how they affect performance\nExperience with performance/load, volume, endurance and reliability testing\nExperience with defect tracking tools and trending\nExploratory testing techniques\nScripting experience with Python</p>\n\n<p>Who We Are</p>\n\n<p>Carbon Black is the leading provider of next-generation endpoint security. Carbon Black’s Next-Generation Antivirus (NGAV) solution, Cb Defense, leverages breakthrough prevention technology, “Streaming Prevention,” to instantly see and stop cyberattacks before they execute. Cb Defense uniquely combines breakthrough prevention with market-leading detection and response into a single, lightweight agent delivered through the cloud. With more than 7 million endpoints under management, Carbon Black has more than 2,500 customers, including 30 of the Fortune 100. These customers use Carbon Black to replace legacy antivirus, lock down critical systems, hunt threats, and protect their endpoints from the most advanced cyberattacks, including non-malware attacks.</p>\n\n<p>Carbon Black, Inc. is an EEO/AA employer. Carbon Black is an inclusive employer that believes in workplace equality, supports diversity, creates a welcoming environment, and respects the unique qualities each individual brings to the company.</p>","how_to_apply":"<p>Click here to apply: <a href=\"https://lifeatcb.carbonblack.com/job/CABLUS82/Senior-QA-Engineer-Performance-Testing\">https://lifeatcb.carbonblack.com/job/CABLUS82/Senior-QA-Engineer-Performance-Testing</a></p>","company":"Carbon Black, Inc.","company_url":"https://www.carbonblack.com/","company_logo":"http://github-jobs.s3.amazonaws.com/9ebeb4b2-b28b-11e7-889d-b2143ab96e83.png","url":"http://jobs.github.com/positions/a1d5d91e-b28b-11e7-84f8-398e4f3969a8"},{"id":"c62c9822-afb4-11e7-98ea-746cca247aa4","created_at":"Fri Oct 13 01:23:08 UTC 2017","title":"Front End Engineer","location":"San Francisco","type":"Full Time","description":"<p>Imagine a world where every car where there’s a smartphone is safer, where massive amounts of data and insights makes cities safer and reduce insurance costs for everyone. Zendrive is executing rapidly on its mission of “making all ground transportation safer using data and analytics” and is focused on building products to support the evolution of transportation.</p>\n\n<p>We are looking for a Front End Software Engineer with 2-3 years experience programming with Modern Javascript Frameworks - like React, Angular or Ember. If you are passionate about writing code that may run on millions of devices, creating a rock solid technology that will save lives and you will not give up until the code is best in class, then Zendrive is the place for you.</p>\n\n<p><b>Responsibilities: </b></p>\n\n<ul>\n<li>Work closely with our product team to craft the next iteration of Zendrive’s front end products and applications</li>\n<li>Partner closely with the design in creating gorgeous, rich and modern web experiences</li>\n<li>Leverage your past successes in helping guide the future of our web properties</li>\n<li>Help us build an amazing continuous integration environment</li>\n</ul><p><b>Required Qualifications: </b></p>\n\n<ul>\n<li>Proactive and passionate attitude</li>\n<li>Good communication skills</li>\n<li>Obsessive about writing tests for modern code</li>\n<li>Basic knowledge of visual design tools; such as: Zeplin, Sketch or Photoshop.</li>\n<li>Strong analytical and numeric skills</li>\n<li>Minimum 2 years of Modern Javascript Frameworks including Single Page Applications and client/API architecture</li>\n<li>Minimum 2 years of application design and development including Responsive Web Applications with deep expertise in one of the following technologies – React, AngularJS, and Ember</li>\n<li>Minimum 2 years of experience with modern DevOps tools and workflows such as git, GitHub, Jira, Jenkins, or equivalents</li>\n<li>Minimum 2 years of Experience with agile development (Kanban, Scrum, etc.) </li>\n</ul><p><b>Preferred Qualifications:</b></p>\n\n<ul>\n<li>Minimum 1 years of API development using tools like Postman</li>\n<li>Minimum 6 months experience with Firebase</li>\n<li>Minimum 3 years of experience in JavaScript</li>\n<li>Minimum 1 years of experience with testing using TDD or BDD with 1 or more testing frameworks (e.g. Mocha/Chai, Jasmine)</li>\n<li>Minimum 1 years of experience in any of the following languages or technologies: Java, Groovy, Ruby, PHP, or Python</li>\n<li>Experience with Responsive Design frameworks, preferably with Bootstrap or Zurb Foundation</li>\n<li>Experience in developing high performing client-side applications</li>\n<li>Knowledge of CSS preprocessors (SASS, LESS or Stylus)</li>\n<li>Knowledge of what works in specific browsers. Responsive CSS (Mobile First, Bootstrap), Semantic HTML and HTML5, JS based languages such as Coffeescript and Typescript</li>\n<li>Strong preference for a design or engineering bachelor’s degree</li>\n</ul><p><b>Why join us?</b> \nWe thought you'd never ask! We offer all the usual stuff: competitive salary, medical/dental insurance, meals on site, gym and Spotify membership, top of the line equipment and compelling early stage equity. </p>\n\n<p>But the real perks are:  </p>\n\n<ul>\n<li>Challenging and fun work on meaningful problems - you'll never have a boring day at the office. </li>\n<li>World-class team of engineers and researchers who love solving tough problems. </li>\n<li>The opportunity to work on a problem that aims to improve the lives of everyone and will make a meaningful, positive impact on the world (while building a multi-billion dollar business). </li>\n<li>The chance to develop lasting business relationships by helping build our growing set of partners.</li>\n</ul>","how_to_apply":"<p><a href=\"https://jobs.lever.co/zendrive/6071ae81-4589-4517-b2b2-faaffb0ffd85?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">Apply Now</a></p>","company":"Zendrive","company_url":"https://www.zendrive.com/","company_logo":"http://github-jobs.s3.amazonaws.com/599c88b6-afb4-11e7-8dff-d6f646f85f4a.png","url":"http://jobs.github.com/positions/c62c9822-afb4-11e7-98ea-746cca247aa4"},{"id":"38173a4a-dbcc-11e6-9c53-e2c21bd61de8","created_at":"Thu Oct 12 01:00:13 UTC 2017","title":"Development Engineer - Working in Japan","location":"Fukuoka,Japan","type":"Full Time","description":"<p><strong>Both Japanese speakers and Non-Japanese speakers welcomed (if working in Fukuoka/ Kyoto)</strong>; there are many English speakers working with the company. Successful applicants without Japanese language skills may be asked to attend a Japanese training course for half of every working day for at least 3 months ~ 12 months after arriving in Fukuoka/ Kyoto. This training is paid for by the employer, and is an excellent chance to pick up new language skills.</p>\n\n<p><strong>Engineer work in LINE:</strong>\n<a href=\"https://www.youtube.com/watch?v=nZm0_ChPzPg&amp;feature=youtu.be\">https://www.youtube.com/watch?v=nZm0_ChPzPg&amp;feature=youtu.be</a></p>\n\n<p><strong>Choose your work location depending on your Japanese language skills!</strong></p>\n\n<ol>\n<li><p><strong>Non-Japanese Speakers</strong>: Assigned to <strong>Fukuoka/ Kyoto office</strong>. However, those wishing to transfer to Tokyo office may do so after attaining basic conversational skills if desired.</p></li>\n<li><p><strong>Japanese Speakers</strong>: Can select <strong>Tokyo/ Fukuoka/ Kyoto office</strong> if Japanese skills equivalent to JLPT Level 2 or above.</p></li>\n</ol><p>Many of the world's best engineers work with the company, and approximately 30% of them hail from overseas. Experienced IT engineers who can put the user's perspective first and wish to make a positive impact on the tens of millions of daily users are encouraged to apply!</p>\n\n<p><strong>Job Description:</strong>\nSuccessful candidates will be assigned as a server-side or app developer based on their previous work experience, as well as their career wishes. Regardless of their actual position, developers are able and encouraged to take part in all of the production process, from planning to implementation.</p>\n\n<p><strong>Specific duties will include :</strong></p>\n\n<ul>\n<li>Development of smartphone applications for the company and clients</li>\n<li>Server development for the company's smartphone applications</li>\n<li>Researching of new technology, followed by test development and information sharing</li>\n<li>Implementation of strategies for service quality maintenance and performance improvement</li>\n</ul><p><strong>Job Requirements:</strong></p>\n\n<ul>\n<li><strong>English language skills (business level or above)</strong></li>\n<li>Non Japanese speaking applicants must be <strong>willing to learn the Japanese language</strong> after arriving Japan</li>\n<li><strong>Professional knowledge of at least one programming language</strong></li>\n<li>Understanding of computer science</li>\n<li>Fundamental knowledge of <strong>memory, processes, threads, and their relation to programming</strong>\n</li>\n<li>A fundamental understanding of <strong>network technology (e.g. TCP/UDP, HTTP, etc.), databases, and SQL</strong>\n</li>\n</ul><p><strong>Preferred Skills:</strong></p>\n\n<ul>\n<li>Experience in developing native apps using <strong>Java/Objective-C</strong>\n</li>\n<li>Experience in Web application development using languages such as <strong>Java, PHP, Perl, Ruby, Python, etc.</strong>\n</li>\n<li>A history of active participation in the Open Source community</li>\n<li><strong>Experience with development/operation of systems with large quantities of data and traffic</strong></li>\n</ul><p><strong>Working hours:</strong>\n<strong>Discretionary and flexible</strong> according to abilities and speed of task completion; if all tasks and projects are completed well and on time, you do not need to stay in the office for extended periods of time.</p>\n\n<p><strong>Salary:</strong>\n<strong>Minimum 6 million Japanese Yen per annual</strong> (higher compensation will be provided based on skills and experience and is negotiable). We also offer <strong>relocation allowance</strong> to the right candidate.</p>\n\n<p><strong></strong>\n<strong>※You are welcome to reapply for this position within the group again\nafter a period of 12 months has passed.</strong></p>","how_to_apply":"<p>Apply Now: <a href=\"http://stackoverflow.com/jobs/132879/development-engineer-working-in-japan-line-line-fukuoka-corporation\">http://stackoverflow.com/jobs/132879/development-engineer-working-in-japan-line-line-fukuoka-corporation</a></p>","company":"LINE","company_url":"http://stackoverflow.com/jobs/companies/line-corporation","company_logo":"http://github-jobs.s3.amazonaws.com/7799e336-dbd4-11e6-86ad-9b97e4b8e572.jpg","url":"http://jobs.github.com/positions/38173a4a-dbcc-11e6-9c53-e2c21bd61de8"},{"id":"7283552e-adf4-11e7-8a23-f56bf969cb96","created_at":"Tue Oct 10 19:52:25 UTC 2017","title":"Software Developer (213234)","location":"Frederick, Maryland","type":"Full Time","description":"<p>The Henry M. Jackson Foundation (hjf.org) is looking for a Software Developer to join the U.S. Army Medical Research and Materiel Command’s Biotechnology High Performance Computing Software Applications Institute (bhsai.org). HJF provides scientific, technical, and programmatic support services to the BHSAI.</p>\n\n<p>Requirements</p>\n\n<p>The Software Developer will create and maintain software tools and applications to support life science research areas. Because the work and technologies involved vary from project to project, we are looking for candidates with expertise and interests in a broad range of areas, from systems programming to web and mobile app development. The developer will work closely with scientists and other software developers to create a wide variety of software solutions. Many of these are publicly available at bhsai.org/software.</p>\n\n<p>The minimum requirements for the software developer position are as follows:</p>\n\n<p>A solid understanding of computer science and software engineering concepts\nStrong experience in one or more programming languages, such as C/C++ or Java\nKnowledge of at least one scripting language, such as Python or Ruby\nUnderstanding of relational database concepts and the ability to write SQL queries and statements\nHands-on experience in professional or open source software development in one or more of the following areas: web, mobile, real-time systems, and graphical user interfaces\nFamiliarity with Windows and Unix-like operating systems (Linux, BSD, OS X, etc.)\nMinimum Education: A bachelor’s degree in computer science, engineering, or a related discipline</p>\n\n<p>Minimum Experience: 0 – 2 years</p>\n\n<p>The following skills and experience are desired:</p>\n\n<p>Experience using a source code version control system, such as Git\nExperience with one or more integrated development environments, such as Eclipse, IntelliJ, or Xcode\nKnowledge and understanding of DevOps, continuous integration, and continuous delivery\nKnowledge of Spring and Hibernate\nKnowledge of Windows and Linux system administration\nForeign nationals (OPT, H1B, permanent residents) and U.S. citizens are encouraged to apply. A background requirement is that the employee must have lived in the U.S. three out of the last five years.  This position is located in Frederick, Maryland.</p>\n\n<p>HJF is an equal opportunity and affirmative action employer.  All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status.</p>\n\n<p>Any qualifications to be considered as equivalents, in lieu of stated minimums, require the prior approval of the Director of Human Resources.</p>","how_to_apply":"<p><a href=\"http://careers.hjf.org/jobs/7956497-software-developer\">http://careers.hjf.org/jobs/7956497-software-developer</a></p>","company":"The Henry M. Jackson Foundation","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/7283552e-adf4-11e7-8a23-f56bf969cb96"},{"id":"30ef7378-a1ff-11e7-8c51-6296e97947b7","created_at":"Tue Oct 10 16:03:04 UTC 2017","title":"Python Software Engineer (m/f)","location":"Berlin","type":"Full Time","description":"<p>Thermondo digitalisiert das Handwerk. Mit einem monatlichen Wachstum von knapp 20% in 2016 und fast 300 Mitarbeitern bundesweit sind wir schon heute der größte Heizungsbauer Deutschlands.</p>\n\n<p><strong>DEINE AUFGABEN</strong></p>\n\n<p>Our Python based backend is the backbone of our Germany wide operation and key to the digitization of the energy business. It’s an enterprise-grade application which connects our own services to third party platforms like Salesforce. The code base is written in Python 3 and our entire stack is up to date. Our main data store is PostgreSQL. Our business is constantly growing and changing. New feature requests or requirement changes may emerge every day. As a result we build software that is highly maintainable to satisfy those needs.</p>\n\n<p>Your job will be to work in small teams on independent projects alongside your non technical colleagues. You will analyze our business needs and implement solutions while maintaining a high quality standard and developing at startup speed. You will have the freedom to use any tools and resources to achieve your goals. Our team of more than ten experienced engineers will support you to reach your full potential.</p>\n\n<p>For more information visit: <a href=\"https://thermondo.github.io\">https://thermondo.github.io</a></p>\n\n<p><strong>DEIN PROFIL</strong></p>\n\n<ul>\n<li>proven Python experience</li>\n<li>hands on Django experience</li>\n<li>a feeling of pride and ownership for your products</li>\n<li>a favor for quality and tests</li>\n<li>ideally familiarity with JavaScript</li>\n<li>fluent in English (German is a plus)</li>\n</ul><p><strong>WAS WIR DIR BIETEN</strong></p>\n\n<ul>\n<li>a solid base salary plus bonus</li>\n<li>flexible working hours</li>\n<li>the chance to become a full stack engineer and a polyglot developer</li>\n<li>paid educational leave incl. a conference budget</li>\n<li>freedom to contribute to the open source community</li>\n<li>a great career track in Berlin’s “hottest” startup</li>\n<li>meaning – Our work has a direct impact on the German energy market</li>\n</ul><p><img src=\"https://tracking.gohiring.com/c?cid=662c9407-f8cb-4024-a169-90c1c45dcfb4&amp;jid=f6d8495f-c22e-4103-97ad-ad201823e687&amp;pid=cf8bf460-5112-41b7-8bf5-c32efc9c0d65&amp;ec=view%3Apixel&amp;cb=https%3A%2F%2Fs3-eu-west-1.amazonaws.com%2Fgohiring-public-assets%2Fpixel.gif\" alt=\"GoHiring\"></p>","how_to_apply":"<p><a href=\"https://tracking.gohiring.com/c?cid=662c9407-f8cb-4024-a169-90c1c45dcfb4&amp;jid=f6d8495f-c22e-4103-97ad-ad201823e687&amp;pid=cf8bf460-5112-41b7-8bf5-c32efc9c0d65&amp;ec=click%3Aapply_url&amp;cb=https%3A%2F%2Fwww.thermondo.de%2Funternehmen%2Fjobs%2Fberlin-zentrale%2Fposition%2F33509%2F\">application form</a></p>","company":"Thermondo","company_url":null,"company_logo":"http://github-jobs.s3.amazonaws.com/128e1f92-a1ff-11e7-95b2-bfca8222f80e.png","url":"http://jobs.github.com/positions/30ef7378-a1ff-11e7-8c51-6296e97947b7"},{"id":"da3da668-add3-11e7-8e75-b3addd57ba19","created_at":"Tue Oct 10 15:59:00 UTC 2017","title":"Senior Full Stack Developer","location":"Munich","type":"Full Time","description":"<p>We are looking for a code enthusiast who is interested in further optimizing and automating the technical integration of our partner shops through developing new features for our business teams. We’re a fashion company but you won’t have to wear the latest Karl Lagerfeld. A hoodie or your favorite Docker shirt will do just fine. If delivering high quality software is your number one priority - then Stylight is your place to be.</p>\n\n<p><strong>Your Responsibilities</strong></p>\n\n<ul>\n<li>You develop tools which automate our shop integration processes and develop data integration pipelines.</li>\n<li>You build and monitor our scalable architecture to support Stylight’s growth - we take pride in building a highly performant and failure resistant platform with a small team.</li>\n<li>You help foster technical excellence in the team, you see the value in unit/integration tests and code reviews.</li>\n<li>You enjoy what you do, and are willing to teach and learn new technologies.</li>\n</ul><p><strong>Our Tech Stack</strong></p>\n\n<ul>\n<li>Our server side code is Python (Tornado, Alembic, SqlAlchemy, RQ, Celery).</li>\n<li>Our client side code is HTML, CSS &amp; Javascript (ES6, ReactJS).</li>\n<li>You build it, you run it! - We run our systems on Amazon Web Services (EC2, Lambda), use Docker &amp; CircleCI to deploy everything and connect to PostgreSQL/MySQL Databases.</li>\n</ul><p><strong>Your Profile</strong></p>\n\n<ul>\n<li>You have mastered at least two programming languages, e.g. Python and Javascript.</li>\n<li>You bring hands-on experience in software development, ideally 3 years or more.</li>\n<li>You have strong communication skills in English.</li>\n<li>You are able to explain technical topics to non-technical colleagues.</li>\n<li>You have ideally worked in an agile, test-driven and interdisciplinary environment before.</li>\n<li>You want to take responsibility and ownership for the software you produce.</li>\n<li>You are open to both old and new and are ready to use the right tool for the right job.</li>\n<li>You see the value of “fail fast, fail often” when you work on a prototype.</li>\n</ul><p><strong>Why Join <a href=\"https://www.stylight.com/\">Stylight</a>?</strong></p>\n\n<ul>\n<li>Stylight is #1 Meetup organizer in Munich, and deeply involved in the local tech community. </li>\n<li>We organize <a href=\"http://daho.am/\">daho.am</a>, our own annual developer conference. Top-notch speakers and over 400 attendees.</li>\n<li>Hands-on work after quick ramp up: You’ll do your first deploy to production during your first week. </li>\n<li>We’ll give you a personal development budget, to go to conferences, buy books and grow with us.</li>\n<li>International and diverse workplace: 44% non-German and 65% female.</li>\n<li>We have one of the best office spaces in Munich (and actually in <a href=\"http://www.horizont.net/marketing/charts/Glispa-Zalando-BMW-Das-sind-die-10-coolsten-Bueros-Deutschlands-141727\">Germany</a>) </li>\n<li>Experience Munich: Our office is in the city-center, and just a 10 minutes walk from the nearest biergarten.</li>\n<li>For more information check out: <a href=\"http://tech.stylight.com/\">Tech Blog</a>\n</li>\n</ul>","how_to_apply":"<p><a href=\"https://stylight-jobs.personio.de/job/38343?_pc=6597#apply\">https://stylight-jobs.personio.de/job/38343?_pc=6597#apply</a></p>","company":"Stylight GmbH","company_url":"https://www.stylight.com/","company_logo":"http://github-jobs.s3.amazonaws.com/cc40c3d8-add3-11e7-9b20-6a38b3b0d726.jpg","url":"http://jobs.github.com/positions/da3da668-add3-11e7-8e75-b3addd57ba19"},{"id":"6ae29c5c-ac6f-11e7-82ea-3ed00a6cf778","created_at":"Sun Oct 08 21:27:43 UTC 2017","title":"Technical Lead","location":"London","type":"Full Time","description":"<p>Lead Engineer Job Spec</p>\n\n<p>Zyper is a venture backed, P2P software company that powers the community programmes of the world’s leading brands from startups all the way through to enterprise. Re-defining influence at a granular level and giving structure to the most effective form of marketing, peer to peer referral.</p>\n\n<p>We also built the viral visual recognition app rubricapp.com</p>\n\n<p>We’re looking for a hands-on Lead Engineer who will take lead technical ownership for the product we are building. This role includes taking responsibility for product development, will require experience mentoring a small offshore team and aligning engineers around a product, you will be aided by Head of Product, COO &amp; CEO.</p>\n\n<p>The role includes: \nAn unmatched environment in which to develop your knowledge of building early-stage tech startups, not just from the tech perspective but the wider business.</p>\n\n<p>Work closely with Head of Product, COO and CEO to build the tech foundation for the business and define roadmap and ensure all products are built to an appropriate level of quality for the stage (alpha, beta, production).\nHands on software development, where you can apply your skills, knowledge &amp; experience across a range of sectors, business models, &amp; products.\nAll the benefits of the startup world (innovation, ownership, pace, etc).</p>\n\n<p>Requirements\nHave been tech lead for one or more startups, but still be hungry for another breakout opportunity\nBe confident across a breadth of programming languages (as below) &amp; platforms and able to go deep on specialist areas \nHave experience managing product development projects, aligning a team around those, and delivering to market or users’ hands.\nAt ease using Kubernetes, PostgreSQL, React, Redux, Flask and AWS as technology stack\nComfortable switching between front and back end development</p>\n\n<p>Tech Stack:</p>\n\n<p>Back End:\nWe use Python, PostgreSQL and deployment on AWS uses Docker &amp; Kubernetes\nOn Instagram interfacing API - we use Node.js v8.1.3</p>\n\n<p>The entire architecture is micro-services based.</p>\n\n<p>Front End:\nFront end stack is: Webpack, Babel, ES6, React &amp; Redux </p>\n\n<p>iOS:\nWe're writing iOS app in Swift.</p>\n\n<p>What are you waiting for? Email you CV at <a href=\"mailto:hello@zyper.co\">hello@zyper.co</a> and drop by for a chat!</p>","how_to_apply":"<p>Email your CV to <a href=\"mailto:hello@zyper.co\">hello@zyper.co</a></p>","company":"Zyper","company_url":"http://www.zyper.co","company_logo":"http://github-jobs.s3.amazonaws.com/26a6c3a6-ac6f-11e7-9089-ef345fc8dcce.jpg","url":"http://jobs.github.com/positions/6ae29c5c-ac6f-11e7-82ea-3ed00a6cf778"},{"id":"c0a925be-928b-11e7-99fb-1549ac463575","created_at":"Fri Oct 06 16:37:17 UTC 2017","title":"Software Engineer, Protein Sciences, Genentech Research","location":"South San Francisco","type":"Full Time","description":"<p>Join a Team that Lives to Improve Lives</p>\n\n<p>People come to Genentech from across disciplines and across the world to solve our most challenging medical conditions. You’ll find inspiration in our passion for biotechnology, our purpose to positively impact the lives of millions of patients and our dedication to our people. Joining Genentech means being part of a tradition of inquiry that will change the world. It means embracing our failures as much as our successes. It requires a willingness to look beyond the edge of what's possible. And a focus on doing the day-to-day work that makes great science happen. </p>\n\n<p>The following opportunity exists in our South San Francisco, CA headquarters:</p>\n\n<p>Software Engineer, Protein Sciences, Genentech Research</p>\n\n<p>Description</p>\n\n<p>Protein Sciences is looking for a full-stack Software Engineer to participate in cross-product software architecture design and implementation. This candidate will be proactive and detail-oriented with strong technical skills, excellent written/verbal communication skills.</p>\n\n<ul>\n<li>Design, develop and implement programs and applications for integration of multiple data sources, manipulation and report</li>\n<li>Optimize existing tools and web application solutions</li>\n<li>Collaborate with scientists to understand workflows, collect requirements and design solutions</li>\n<li>Perform prototyping, application tests and code optimization to ensure product excellence</li>\n<li>Write clean, robust, maintainable, documented code using best engineering practices</li>\n<li>Practice agile methodology to ensure reliable and modular code</li>\n</ul><p>Who You Are</p>\n\n<ul>\n<li>Full-stack engineer with at least Bachelor degree in computer science or software engineering</li>\n<li>Experience working in Agile development environment</li>\n<li>5+ years of software programming experience in Java, Javascript, SQL, AngularJS, HTML, Python</li>\n<li>Database design: Oracle, MongoDB</li>\n<li>Proficiency in software lifecycle management tools; maintaining version control with Git and tracking with Atlassian tools (or similar)</li>\n<li>Excellent written and verbal communications skills</li>\n</ul><p>A Job with Benefits Beyond the Benefits</p>\n\n<p>A member of the Roche Group, Genentech has been at the forefront of the biotechnology industry for more than 40 years, using human genetic information to develop novel medicines for serious and life-threatening diseases. Genentech has multiple therapies on the market for cancer &amp; other serious illnesses. Please take this opportunity to learn about Genentech where we believe that our employees are our most important asset &amp; are dedicated to remaining a great place to work.</p>\n\n<p>The next step is yours. To apply today, click on the \"Apply online\" button.</p>\n\n<p>Genentech is an equal opportunity employer &amp; prohibits unlawful discrimination based on race, color, religion, gender, sexual orientation, gender identity/expression, national origin/ancestry, age, disability, marital &amp; veteran status. For more information about equal employment opportunity, visit our Genentech Careers page.</p>\n\n<p>Apply Link: <a href=\"https://www.gene.com/careers/detail/2734120811/Software-Engineer-Protein-Sciences-Genentech-Research\">https://www.gene.com/careers/detail/2734120811/Software-Engineer-Protein-Sciences-Genentech-Research</a></p>","how_to_apply":"<p><a href=\"http://www.gene.com/careers/find-a-job/apply/2734120811?src=JB-11480\">http://www.gene.com/careers/find-a-job/apply/2734120811?src=JB-11480</a></p>","company":"Genentech, Inc.","company_url":"http://Genentech, Inc.","company_logo":"http://github-jobs.s3.amazonaws.com/7a30c0ce-928b-11e7-8bbf-86f717d52dc5.PNG","url":"http://jobs.github.com/positions/c0a925be-928b-11e7-99fb-1549ac463575"},{"id":"c202950a-aa71-11e7-9494-55b0099329f8","created_at":"Fri Oct 06 09:05:36 UTC 2017","title":"Fullstack Web Developer (m/f)","location":"Bochum","type":"Full Time","description":"<p>Wir entwickeln digitale Produkte und Services für den Energiemarkt von übermorgen. Unser Arbeitsansatz ist pragmatisch und wir scheuen nicht davor zurück, unsere Methoden stetig zu hinterfragen. In kleinen und interdisziplinären Teams erarbeiten wir Lösungsansätze auf Augenhöhe und legen Wert darauf, dass jeder seine Expertise bestmöglich in den Produktentwicklungsprozess mit einfließen lässt.<br><br><strong>Wir suchen ab sofort</strong> zur Unterstützung unseres Offices im Herzen von Bochum:<br><br><strong>Fullstack Web Developer (m/f)</strong><br><br><strong>Das sind deine Aufgaben</strong></p>\n\n<ul>\n<li>Umsetzung innovativer, <strong>skalierbarer</strong> und sicherer <strong>Web-Apps</strong> und <strong>-Frontends</strong> mit <strong>modernsten Technologien</strong>\n</li>\n<li>Du arbeitest in kleineren Teams - zusammen mit Produkt Manager und <strong>UX-Designern</strong>\n</li>\n<li>Design und Umsetzung von skalierbaren <strong>Backend-Systemen,</strong> bereit für den Einsatz in der <strong>Cloud</strong>\n</li>\n<li>Du entwirfst robuste und erweiterbare Datenmodelle und Schemata</li>\n<li>Du überprüfst deine Arbeit und Definitionen automatisiert</li>\n<li>Du definierst Metriken zum Monitoring im Test und Betrieb</li>\n<li>Du dokumentierst angemessen, damit deine Arbeit nachvollziehbar und reproduzierbar wird.</li>\n<li>Du arbeitest dich in kürzester Zeit gerne in neue Aufgabengebiete ein und teilst dein Wissen (z.B. in Meetups). Durch Code Reviews sicherst du die Produktqualität und nutzt das konstruktive Feedback des Teams</li>\n</ul><p><strong>Das bringst du mit</strong></p>\n\n<ul>\n<li>Du hast Lust in einer agilen und schnellen Welt selber zu coden</li>\n<li>Du hast ein abgeschlossenes Studium der Informatik oder eine vergleichbare Qualifikation mit Erfahrung in der webbasierten Backend- und Frontend-Programmierung sowie Datenbankdesign</li>\n<li>Du beherrschst mindestens eine Backend-Programmiersprache ( <strong>JavaScript, Ruby,</strong> Python, Elixir …)</li>\n<li>Frameworks und Middlewares wie <strong>Koa, Loopback, Rails oder Flask</strong> sind dir bekannt</li>\n<li>Plain <strong>HTML5, CSS3, JS</strong> sprichst du fließend, nutzt aber auch gerne Frameworks wie <strong>React</strong> oder <strong>Vue</strong> und hast damit bereits Projekte realisiert</li>\n<li>Du nutzt Werkzeuge wie <strong>Swagger</strong> nicht nur zum Design, sondern auch zur Dokumentation und Wissensvermittlung. <strong>REST, JWT, OAuth2</strong> sind alte Bekannte</li>\n<li>Du hast bereits mit verschiedensten Datenbank-Systemen Erfahrung (z.B. <strong>PostgreSQL, MongoDB, Redis</strong> o.ä.), nutzt Relationen und Dokumentenstrukturen ideal und vermeidest Performance-Probleme</li>\n<li>DevOps/CI/CD sind dir bekannt, <strong>Docker</strong> ist dir eine Hilfe, das Arbeiten mit Git selbstverständlich</li>\n</ul><p><strong>Wir bieten dir</strong></p>\n\n<ul>\n<li>Ein <strong>Mega Team</strong> ;-), flache Hierarchien und extrem kurze Entscheidungswege</li>\n<li>\n<strong>Neueste Hardware und Freiheit</strong> in der Wahl deiner Tools</li>\n<li>Die Möglichkeit <strong>neueste Technologien</strong> bis hin zur Produktreife zu nutzen. Wir wählen unsere Tools und wohlüberlegt aus und bewerten diese kontinuierlich.</li>\n<li>Zeit und Ressourcen zum Lernen - von Kollegen, bei <strong>Meetups oder auf Konferenzen</strong>\n</li>\n<li>Kontakt zu Nachbarn aus der lokalen und nationalen <strong>Gründer- und Entwicklerszene</strong>\n</li>\n<li>Ein inspirierender Arbeitsplatz mit <strong>Startup Flair</strong> mitten im Ruhrpott (#Berlinkannjeder)</li>\n<li>Hohes Maß an Freiheit durch <strong>flexible Arbeitszeiten</strong> und Arbeitsmodelle</li>\n<li>Eine <strong>agile und methodische Arbeitsweise.</strong> Schaue dazu gerne in unser Playbook unter <a href=\"http://bdstudio.de/playbook.html\">http://bdstudio.de/playbook.html</a>\n</li>\n</ul><p>Überzeuge uns und bewirb dich mit deinem Profil (Lebenslauf/CV, LinkedIn, Xing, GitHub, etc.) über den <strong>Link</strong> an der rechten Seite oder per E-Mail an jobs@bdstudio.de.<br><br>\nReferenz: <a href=\"http://bdstudio.de/jobs.html\">http://bdstudio.de/jobs.html</a><br><br>\nKontakt: <a href=\"mailto:jobs@bdstudio.de\">jobs@bdstudio.de</a><br><br><em>Keywords: Stellenanzeige, Vollzeit, Bochum, Backend, Frontend, Programmierung.</em></p>","how_to_apply":"<p><a href=\"https://BermudaDigitalStudio.has-jobs.com/f/80d32877-d40f-4eef-95a7-0bdb5439f0d0/apply?channelId=V819\">Klick hier um dich zu bewerben!</a></p>","company":"Bermuda Digital Studio","company_url":"https://BermudaDigitalStudio.has-jobs.com/f/80d32877-d40f-4eef-95a7-0bdb5439f0d0/apply?channelId=V819","company_logo":"http://github-jobs.s3.amazonaws.com/6f25f048-aa71-11e7-9b83-5ea108595a58.png","url":"http://jobs.github.com/positions/c202950a-aa71-11e7-9494-55b0099329f8"},{"id":"6d3927c6-a9fb-11e7-9d56-53be8d84ca84","created_at":"Thu Oct 05 18:32:04 UTC 2017","title":"Data Engineer","location":"San Francisco","type":"Full Time","description":"<h1>About Quilt</h1>\n\n<p>Quilt's mission is to define the standard unit of enterprise data so that people and machines can learn faster. We believe that data should be managed like source code (with packaging, versioning, compilation, linting, and more). Our pilot customers are Fortune 500s who find that Quilt makes their data discoverable, reproducible, and auditable.</p>\n\n<p>You can learn more about Quilt in our <a href=\"https://www.youtube.com/watch?v=4S68CJN4N_0\">Y Combinator Demo Day presentation</a>, or on our <a href=\"https://quiltdata.com/\">website</a>.</p>\n\n<p>We're a small team of engineers who care deeply about code quality\nand user experience. We believe that data packages are the future of\ndata management, and we're actively defining the package standard through\n<a href=\"https://github.com/quiltdata/quilt-compiler\">our open source projects</a>.</p>\n\n<h1>About You</h1>\n\n<p>You have deep experience in several of the following domains:</p>\n\n<ul>\n<li>Distributed data</li>\n<li>Spark, Python, R</li>\n<li>Databases</li>\n<li>ETL</li>\n<li>Hadoop, Hive</li>\n<li>Parquet, ORC, Avro</li>\n<li>Docker, Kubernetes</li>\n<li>Machine learning (TensorFlow, PyTorch, scikit-learn)</li>\n<li>Apache Arrow</li>\n<li>Apache Airflow</li>\n</ul><h1>Cover letter</h1>\n\n<p>Please include at least three projects in data engineering that you've worked on. And tell us why you're interested in Quilt.</p>\n\n<h1>Minimum Qualifications</h1>\n\n<ul>\n<li>3 years of development experience</li>\n<li>BS in Computer Science or related field</li>\n</ul>","how_to_apply":"<p>Send your resume and cover letter to <a href=\"mailto:contact@quiltdata.io\">contact@quiltdata.io</a>.</p>","company":"Quilt - Docker for data","company_url":"https://quiltdata.com","company_logo":"http://github-jobs.s3.amazonaws.com/43deabbc-a9fb-11e7-9c13-f951a67525cd.png","url":"http://jobs.github.com/positions/6d3927c6-a9fb-11e7-9d56-53be8d84ca84"},{"id":"d7a84152-a9f9-11e7-8c19-ce47d198cc32","created_at":"Thu Oct 05 18:20:59 UTC 2017","title":"Developer Advocate in Data Engineering","location":"San Francisco","type":"Full Time","description":"<h1>About Quilt</h1>\n\n<p>Quilt's mission is to define the standard unit of enterprise data so that people and machines can learn faster. We believe that data should be managed like source code (with packaging, versioning, compilation, linting, and more). Our pilot customers are Fortune 500s who find that Quilt makes their data discoverable, reproducible, and auditable.</p>\n\n<p>You can learn more about Quilt in our <a href=\"https://www.youtube.com/watch?v=4S68CJN4N_0\">Y Combinator Demo Day presentation</a>, or on our <a href=\"https://quiltdata.com/\">website</a>.</p>\n\n<p>We're a small team of engineers who care deeply about code quality\nand user experience. We believe that data packages are the future of\ndata management, and we're actively defining the package standard through\n<a href=\"https://github.com/quiltdata/quilt-compiler\">our open source projects</a>.</p>\n\n<h1>About You</h1>\n\n<p>You have a successful track record of designing and implementing software systems at scale. You are a world-class communicator (in writing, on stage, and behind closed doors).</p>\n\n<p>You write beautiful technical articles. You can explain technical concepts to newcomers.</p>\n\n<p>You have deep experience in several of the following domains:</p>\n\n<ul>\n<li>Distributed data</li>\n<li>Spark, Python, R</li>\n<li>Databases</li>\n<li>ETL</li>\n<li>Hadoop, Hive</li>\n<li>Parquet, ORC, Avro</li>\n<li>Docker, Kubernetes</li>\n<li>Machine learning (TensorFlow, PyTorch, scikit-learn)</li>\n<li>Apache Arrow</li>\n<li>Apache Airflow</li>\n</ul><h1>Cover letter</h1>\n\n<p>Please include at least two videos of you speaking in public, two technical articles you've written, and two slide presentations you've created. And tell us why you're interested in Quilt.</p>\n\n<h1>Minimum Qualifications</h1>\n\n<ul>\n<li>5+ years of development experience</li>\n<li>BS in Computer Science or related field</li>\n<li>Demonstrated track record in public speaking and writing technical articles</li>\n</ul>","how_to_apply":"<p>Send your resume and cover letter to <a href=\"mailto:contact@quiltdata.io\">contact@quiltdata.io</a>.</p>","company":"Quilt - Docker for data","company_url":"https://quiltdata.com","company_logo":"http://github-jobs.s3.amazonaws.com/38d20658-a9f9-11e7-9112-fd1153fe4e66.png","url":"http://jobs.github.com/positions/d7a84152-a9f9-11e7-8c19-ce47d198cc32"},{"id":"3dfa093c-a9c7-11e7-9e89-df72479fe75d","created_at":"Thu Oct 05 12:18:31 UTC 2017","title":"Python Software Engineer","location":"London","type":"Full Time","description":"<p><strong>What We Do</strong></p>\n\n<p>We're focused on creating human capital technology for some of the world's most innovative organizations and are looking for engineers to help architect and build products that revolutionize how companies find talent. We've raised financing from some of the most notable Silicon Valley founders and investors behind Google, Facebook, Palantir, Tesla and Spotify and are looking for smart, creative people to be part of our next chapter.</p>\n\n<p><strong>Your Role</strong></p>\n\n<p>Working within engineering at RolePoint means you'll be operating in team where ownership is promoted at every stage of the development lifecycle. You'll play a key role in building a platform that's changing how Technology, Finance, Media, Healthcare organizations access talent and is already implemented in the three largest employers in the world. More specifically, you'll be building the most advanced and user-friendly application flow that candidates go through when applying to jobs online.</p>\n\n<p>Based in our London office, you'll work alongside passionate, like minded individuals, where ideas and innovation take precedent and each team member contributes equally. You'll be writing code and architecting solutions, all whilst maintaining balance between great design and shipping products.</p>\n\n<p><strong>Our Culture</strong></p>\n\n<p>We're building a company that allows you to work on interesting projects in a stimulating, social environment. We work on flexible hours, offer unlimited vacation days, go out for weekly team activities and once a year bring the whole company together on an international gathering to reconnect outside of our work.</p>\n\n<p><strong>What We Value</strong></p>\n\n<ul>\n<li>You're passionate about innovation and want to have a tangible impact on what we develop and how.</li>\n<li>You're equally comfortable owning individual deliverables or working within small teams.</li>\n<li>You learn quickly and can adapt to a fast paced development and release schedule.</li>\n<li>You want to work with a speed and agility you don't find in larger companies.</li>\n<li>You have a desire to grow, develop and learn within your role.</li>\n<li>You want to ship technology that has a genuine impact on the world's largest organizations.</li>\n</ul><p><strong>Requirements</strong></p>\n\n<ul>\n<li>Solid backend development skills</li>\n<li>Python or equivalent high level languages, e.g. Ruby</li>\n<li>Enjoys getting their hands dirty, in and out of code</li>\n<li>Create and manage libraries used by other engineers</li>\n<li>Good with people; interpersonal and communication skills and used to collaborating with both technical and non-technical people</li>\n<li>Works effectively within a distributed company</li>\n</ul><p><strong>Nice to Haves</strong></p>\n\n<ul>\n<li>Functional programming</li>\n<li>Google App Engine - especially datastore</li>\n<li>Experience with SAML, OAuth</li>\n<li>A bonus having experience working with Applicant Tracking Systems</li>\n</ul><p><strong>Compensation and Benefits</strong></p>\n\n<ul>\n<li>Competitive salary package</li>\n<li>Company equity - sharing in our success is a key part of your compensation</li>\n<li>Unlimited vacation time</li>\n<li>Macbook Pro, Thunderbolt Display, your choice of peripherals.</li>\n<li>Yearly company offsite bringing together all our teams</li>\n<li>Attending local/international conferences</li>\n<li>Book and reading allowances</li>\n<li>Courses and training</li>\n<li>Extra perks to choose from including Netflix, Spotify subscriptions, Uber credits, healthcare insurance, discounted gym memberships.</li>\n</ul>","how_to_apply":"<p><a href=\"https://hire.withgoogle.com/public/jobs/rolepointcom/view/P_AAAAAACAAADBA2-4AuQOH-?trackingTag=github\">https://hire.withgoogle.com/public/jobs/rolepointcom/view/P_AAAAAACAAADBA2-4AuQOH-?trackingTag=github</a></p>","company":"RolePoint","company_url":"http://www.rolepoint.com","company_logo":"http://github-jobs.s3.amazonaws.com/38ed1876-a9c7-11e7-9c26-a64dd76f2d84.png","url":"http://jobs.github.com/positions/3dfa093c-a9c7-11e7-9e89-df72479fe75d"},{"id":"0b36ea30-a92f-11e7-9cc5-c4a811d8461f","created_at":"Wed Oct 04 18:11:30 UTC 2017","title":"Software Engineer","location":"Vancouver, BC","type":"Full Time","description":"<p>DESCRIPTION</p>\n\n<p>Hey, we’re Article. We’re a leading vertically integrated e-commerce brand that’s re-engineering the furniture experience one sofa at a time. We don’t have brick and mortar stores, so we’re able to deliver remarkable value on beautiful, modern furniture. Instead, we use technology to change how consumers furnish their homes. Because of this, we’re growing like crazy and we need a few more hands on deck. Maybe it’s you we’re looking for?</p>\n\n<p>You will significantly impact the Article business by working on some of these projects:\nMarketing spend attribution and performance analysis.\nCreating A/B tests for improving conversion rates\nPurchasing and inventory forecasting\nProduct sales predictions\nWhere should our warehouses be?\nShipment load optimization and routing\nReporting key KPI across all departments</p>\n\n<p>REQUIREMENTS</p>\n\n<p>We are primarily a Java shop, Excellent command over Java software language is a must.\nExperience building web applications using Java software\nExperience in other languages is an asset, especially in Python.\nExperience with Playframework not needed but will be an asset.\nShould be able to hand code CSS and SCSS. Should be able to write clean style sheets.\nExperience in JavaScript and frameworks like jQuery, Angular 2 / React Js.\nShould be able to write custom JavaScript components.\nGood problem solving skills as it relates to software developers\n4+ Years of software development experience.\nBachelor Degree or Higher in Computer Science, Software Development or related fields.</p>\n\n<p>BENEFITS</p>\n\n<p>We want Article to be an amazing place to work, and we take care of our team. We strive to help our customers spend less and live more, and we want to do the same for our staff. In addition to a competitive salary, we provide:\nA comprehensive benefits package (after a 3 month probationary period).\nSignificant discounts on our beautiful products to help decorate your home, and also for your friends and family.\nRegular fun, extracurricular activities - we are open to suggestions from the whole team, so come armed with some ideas!\nA regularly stocked kitchen full of delicious things to eat and drink.</p>","how_to_apply":"<p>To apply for this position, please email your resume to: <a href=\"mailto:F87EB0C498@jobs.workablemail.com\">F87EB0C498@jobs.workablemail.com</a>\nOR\nvisit our careers page at: <a href=\"https://www.article.com/careers\">https://www.article.com/careers</a></p>","company":"Article","company_url":"https://www.article.com/careers","company_logo":"http://github-jobs.s3.amazonaws.com/fec488fc-a92e-11e7-9aa6-dc51123ae1ea.jpg","url":"http://jobs.github.com/positions/0b36ea30-a92f-11e7-9cc5-c4a811d8461f"},{"id":"2f9a5a9a-a92c-11e7-832d-ac16882f6a6b","created_at":"Wed Oct 04 17:48:47 UTC 2017","title":"Full-Stack Ruby on Rails Developer","location":"New York, NY","type":"Full Time","description":"<p>Zype's Product and Engineering team is focused on reducing friction and simplifying the complex video delivery supply chain. We want to constantly deliver better value and higher quality user experiences as our solution achieves scale. We care about delighting our customers in small and large ways throughout the product. We look inwards, to our customers, to drive innovation, while always keeping an open mind for new growth opportunities.</p>\n\n<p>Zype is looking for a Full-Stack Developer to work on our SaaS platform. You'll be part of the Platform Engineering team and will have the opportunity to innovate every day. Our core platform is built using Ruby on Rails, but we actively use Ruby, Python and JavaScript right now, while also pushing toward Go development in some newer tools and services. While your primary role will involve coding the application and tools that make up our platform this person will also actively work in defining and building the infrastructure that supports the platform as well.</p>\n\n<p>You’ll work on a number of exciting products and interfaces, including our web video player and web embeddables products, SaaS platform software, microservice interfaces, split testing marketing pages, and much more. The ideal candidate is motivated by delivering high quality experiences, can work supremely well in a team context but can also function with some ambiguity, and cares a lot about learning, growth, and moving the needle.</p>\n\n<p>Responsibilities:</p>\n\n<ul>\n<li>Have a passion for writing scalable code, efficiently, at a high quality level. </li>\n<li>Participate in defining, refining and communicating software requirements </li>\n<li>Partner with Product Managers &amp; QA to ensure product requirements are met and we’re delivering value to customers </li>\n<li>Work well with local and remote team members </li>\n<li>Touch all aspects of development and operations, design, build, testing, deployment.</li>\n</ul><p>Requirements:</p>\n\n<ul>\n<li>Applied experience with Ruby on Rails at the intermediate to master level </li>\n<li>Experience in front-end development - JavaScript, HTML5, CSS etc. </li>\n<li>Know SQL, Git, and working with APIs </li>\n<li>Know AWS and how to deploy your own code (and not just to Heroku) </li>\n<li>Have conviction around integration unit testing </li>\n<li>Experience in Test Driven Development and focus on quality and scale </li>\n<li>Experience using a continuous integration/continuous deployment process. </li>\n<li>Experience with video streaming a huge plus </li>\n<li>Computer science degree or 2+ years professional software development experience</li>\n</ul><p>Bonus Points:</p>\n\n<ul>\n<li>Familiarity with Docker is a plus </li>\n<li>Experience with NoSQL, especially MongoDB </li>\n<li>Experience with data analytics and visualization </li>\n<li>Experience developing using a microservice architecture </li>\n<li>Experience working in agile development team </li>\n<li>Experience in video players and/or video publishing a HUGE plus</li>\n</ul><p>Why Zype?</p>\n\n<p>Zype is the video distribution service for OTT. We are dedicated to making it easy for content owners to connect directly with their audiences on every screen. With Zype, content owners can own and accelerate all aspects of video distribution direct to consumer.</p>\n\n<p>The Zype cloud service provides publishing, monetization, streaming, audience management, and analytics software that is integrated into hundreds of web, mobile, and OTT apps and engaged by millions of viewers every month.</p>\n\n<p>We are based in NYC on West 28th Street. We offer competitive salaries, equity incentives, and comprehensive benefits. Read about our core values and how we hire to learn more about us.</p>","how_to_apply":"<p><a href=\"http://grnh.se/m86qlb1\">http://grnh.se/m86qlb1</a></p>","company":"Zype","company_url":"http://www.zype.com","company_logo":null,"url":"http://jobs.github.com/positions/2f9a5a9a-a92c-11e7-832d-ac16882f6a6b"},{"id":"0c2e8e62-a929-11e7-887c-bfaca776c651","created_at":"Wed Oct 04 17:25:43 UTC 2017","title":"Senior Staff Engineer, Test","location":"Santa Monica, CA, US","type":"Full Time","description":"<p></p><p><strong>LOCATION:       </strong>Santa Monica<br><strong>TITLE:                </strong>Senior Staff Engineer, Test<br><strong>REPORTS TO:   </strong>QA Engineering Manager</p><p> </p><p>TigerText is seeking an experienced hands on Senior Staff Engineer, Test to join our team of highly-driven engineers. This individual will be able to design and develop the mobile automation framework. This individual can build and execute test cases, document results, and resolve issues with the development team. A successful candidate must have a passion for technology and a desire to improve our software's usability and functionality.</p><p> </p><p><strong>What You’ll Own:</strong></p><ul>\n<li>Develop automation frameworks for IOS and Android native apps</li>  <li>Understand and uphold a high standard on how products should function</li>  <li>Structure the automation testing plans on multiple projects and technology platforms, estimating schedules, and resources</li>  <li>Match product function and design to the desired user experience</li>   <li>Advocate for the end users during the engineering process</li>  <li>Create high-quality, maintainable test software</li>    <li>Execute best QA practices, implement during all hands-on work</li>  <li>Ensure smooth processes during full Software Development Life Cycle<br>  </li>\n</ul><p><strong>What You’ve Accomplished:</strong></p><ul>\n<li>Bachelor's degree in CS, MIS, QA, or IT</li>    <li>8+ years experience developing software testing tools and test suites in various languages, such as Javascript and Java</li>    <li>5+ years experience building automated GUI tests in Selenium and building automated tests for REST APIs</li>    <li>Working knowledge of the following technologies JUnit, Python, Javascript, Perl, SQL, and Selenium</li> <li>5+ years experience with bug tracking systems (ex. JIRA, experience with source control systems (ex. Git, SVN)</li> <li>Experience in testing, development, and software design</li>    <li>Experience with building frameworks for various platforms</li>  <li>Familiarity with build tools such as Gradle, Maven, Inteliji<br>     </li>\n</ul><p><strong>What You Bring to the Table:</strong></p><ul>\n<li>Experience in Agile SDLC, Continuous Integration, and Continuous Deployment</li>    <li>You enjoy working with Object Oriented programming languages like Java, C#, and C++</li>    <li>Excellent written, verbal, and interpersonal communication skills</li>  <li>It’s a plus if you have Appium, Espresso, or XCUI experience</li> <li>Should have basic Computer Science and conceptual knowledge such as data structures and algorithms</li> <li>Hands-on, proactive, and able to operate effectively in a fast-paced, rapidly changing environment</li> <li>Energy and positivity to instill into the TigerText culture</li>    <li>Healthcare, SaaS, or Enterprise industry experience is a plus</li>\n</ul><p> </p><p><strong>Who We Are:</strong></p><p>As healthcare’s largest provider of clinical communication solutions, TigerText helps physicians, nurses, and other staff communicate and collaborate more effectively, accelerating productivity, reducing costs, and improving patient outcomes. With over 7,000 facilities, delivering hundreds of millions of messages monthly, TigerText continually delivers advanced product innovations and integrates with critical hospital systems such as the EHR, nurse call, and scheduling solutions. It is recognized as a top <a href=\"http://www.builtinla.com/2015/03/11/6-must-see-la-tech-office-spaces\">Must-See LA Tech Office</a>, one of the <a href=\"http://www.entrepreneur.com/article/232049\">5 Sizzling Silicon Beach Startups to Watch</a>by Entrepreneur, and one of the Best Places to Work in Healthcare for <a href=\"http://www.modernhealthcare.com/article/20150821/INFO/150819874\">2015</a>, <a href=\"http://www.modernhealthcare.com/article/20160711/INFO/160709933\">2016</a>, and <a href=\"http://www.modernhealthcare.com/article/20170520/INFO/170519830\">2017</a>. TigerText currently has over 125 employees with offices in Santa Monica and Palo Alto.</p><p> </p><p><strong>Why We’re Different:</strong></p><ul>\n<li>We are the largest provider of clinical communication and collaboration solutions in the U.S.</li>  <li>We're making much-needed, major changes in the healthcare industry - allowing nurses and doctors to treat more patients, more quickly</li>  <li>Prime office space in the major tech ecosystems of California - Silicon Beach and Silicon Valley - each complete with a loaded fridge and tons of other perks (think rock climbing wall, food trucks, yoga, happy hours &amp; more)</li>    <li>An opportunity to work closely with a proven executive team, board, and serial entrepreneurs (<a href=\"http://www.tigertext.com/about\"></a><a href=\"http://www.tigertext.com/about\">www.tigertext.com/about</a>)</li>    <li>A fun environment that embraces a “work hard-play hard” culture</li>    <li>We have team members that love what they do and are willing to go the extra mile to help clients, support the company's rapid growth, and ultimately optimize healthcare workflows</li> <li>This is a full time opportunity with competitive salary and medical benefits</li>\n</ul><p> </p><p><em>TigerText is an Equal Opportunity Employer.</em></p><p><strong>*Recruiting firms that submit resumes to TigerText without first entering into a written contract with TigerText will </strong>not<strong> be entitled to any compensation on candidates referred by that firm.</strong></p> <img src=\"https://www.applytracking.com/track.aspx/7XmR9\">","how_to_apply":"<p><a href=\"https://www.applytracking.com/track.aspx/7XmRJ\">https://www.applytracking.com/track.aspx/7XmRJ</a></p>","company":"TigerText","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/0c2e8e62-a929-11e7-887c-bfaca776c651"},{"id":"db637058-a8ed-11e7-870c-8bfbc3f8fb2f","created_at":"Wed Oct 04 10:30:01 UTC 2017","title":"Java / Python developer","location":"Barcelona","type":"Full Time","description":"<p>WHAT WE LOOK FOR</p>\n\n<p>We are looking for talented Java or Python developer to join our young and international team based in Barcelona. As Cloud Developer Specialist you will be responsible of providing outstanding support for Google Cloud Platform products and gather feedback to help improve the Cloud Platform products.</p>\n\n<p>Minimum requirements:</p>\n\n<p>100% fluent in English (minimum C1) both written and spoken</p>\n\n<p>Previous experience as Developer</p>\n\n<p>Familiar with web protocols (HTTP, TLS, SSL etc)</p>\n\n<p>Firm understanding of programming (Python or Java)</p>\n\n<p>Background in SQL</p>\n\n<p>Ability to read and understand logs and stack traces.</p>\n\n<p>Ability to research using internal knowledge bases and public facing documentation (Google Developers, StackOverflow..)</p>\n\n<p>Familiarity with modern API technologies (OAuth, HTTP RPCs).</p>\n\n<p>Able to work with rotating shifts Monday till Sunday.</p>\n\n<p>European citizenship or work permit in spain</p>\n\n<p>WHAT YOU WILL GET</p>\n\n<p>You will get a full time and permanent contract with an international company, with the chance to grow up and develop your career in the IT Field.</p>\n\n<p>The salary is 28.000€ gross a year (base + bonus), for the first six to twelve months, having the chance to be promoted. You will also get 140€ a month as ticket restaurant and private health insurance, and a relocation package in case it’s needed.</p>\n\n<p>The shift will be rotating between 6am and 8pm, Monday till Sunday (9 hours a day with 1 hour as a break lunch), working normally one weekend a month. </p>\n\n<p>WHO WE ARE</p>\n\n<p>SELLBYTEL is a consolidated and dynamic international company providing service to the top 10 companies belonging to the IT and social networking world. We are based in the heart of Barcelona with more than 3000 employees from all over the world. On top of that, we offer an attractive environment with a great team spirit. </p>\n\n<p>The recruitment processes and people involved in them (both recruiters and Project Managers) will not discriminate any candidacy because of age, disability, ethnic, marital status, gender, nationality, ideology, political, race, religion and sexual orientation.</p>","how_to_apply":"<p>Send your resume to <a href=\"mailto:mgilabert@google.com\">mgilabert@google.com</a></p>","company":"Sellbytel Group S.A.","company_url":null,"company_logo":"http://github-jobs.s3.amazonaws.com/95a7d310-a8ed-11e7-84aa-5b2e49a054e7.png","url":"http://jobs.github.com/positions/db637058-a8ed-11e7-870c-8bfbc3f8fb2f"},{"id":"0bc1a2c2-9112-11e7-89b2-e032ce196266","created_at":"Wed Oct 04 08:29:43 UTC 2017","title":"開発エンジニア","location":"Fukuoka,Japan","type":"Full Time","description":"<p>全世界230か国、2億人以上の月間アクティブユーザーを持つLINEでは、 大規模ユーザーベースをもとに様々なプロジェクト・サービス開発を行っています。 </p>\n\n<p>現在、そんな組織で開発に携わる仲間を募集しています。ご経験と今後のキャリアのご希望を伺った上で、サーバサイド開発やアプリ開発などを行って頂きます。</p>\n\n<p><strong>「LINE Creators Studio」「LINE Creators Market」「LINE 占い」「LINE バイト」など世界中のユーザーにむけてリリースするLINEファミリーアプリの開発を行います。</strong></p>\n\n<p><strong>【具体的には】</strong></p>\n\n<ul>\n<li>新規アプリの開発 </li>\n<li>既存アプリの運用、機能追加、改善 </li>\n<li>サーバサイドの開発 </li>\n<li>クライアントサイドの開発 </li>\n</ul><p><strong>【アプリ開発の流れ】</strong></p>\n\n<p>開発は、グローバル各拠点の企画、デザイナー、テスター（QA室）とプロジェクトを組み、協力・連携しながらリモートで進行します。 \n企画検討→開発実務→テスト→リリース→リリース後の運用や機能の追加・改善企画の段階から開発サイドとしての意見や提案、要望をおこないます。プロジェクト次第で、国内・海外出張もあります \n（顔をあわせてのコミュニケーションも大切にしています） </p>\n\n<p>意思決定においてはスピード感あることや、\n無駄なミーティングは極力少めで、開発に集中できる環境にあります。 \n新しい開発手法やオープンソースライブラリを積極的に活用しています。 \nまた、入社後にお好きなハイスペックマシーン、関連機器を提供しています。</p>\n\n<p><strong>応募資格：</strong>\n<strong>【必須の経験・スキル】</strong></p>\n\n<ul>\n<li>1つ以上の精通したプログラミング言語が有ること</li>\n<li>プログラミングをする上でのメモリ、プロセス、スレッドの基礎知識</li>\n<li>TCP/UDP、HTTP など ネットワークの基礎知識</li>\n<li>データベース・SQLの基礎知識</li>\n</ul><p><strong>【歓迎する経験・スキル】</strong></p>\n\n<ul>\n<li>\n<strong>Javaや、Objective-C</strong> を用いたネイティブアプリの開発経験</li>\n<li>\n<strong>Java、PHP、Perl、Ruby、Python</strong> といった開発言語を用いたWebアプリケーション開発経験</li>\n<li><strong>オープンソースソフトウェアコミュニティでの活動経験</strong></li>\n<li>\n<strong>大規模データ、トラフィックを扱うシステム</strong>の開発・運用経験</li>\n</ul><p><strong>【歓迎する人物像】</strong></p>\n\n<ul>\n<li>新しい技術の探究や習得に意欲的な方、知的好奇心やチャレンジ精神が旺盛な方**</li>\n<li>これまでの開発経験を活かして、コンシューマー向けのサービス開発に取り組みたい方</li>\n<li>技術志向の強いエンジニア、ユーザー視点を大事にした開発ができる方</li>\n<li>人々の生活スタイルに新しい価値を提供するようなインパクトある開発がしたい方</li>\n</ul><p><strong>勤務地：</strong>\nLINE Fukuoka株式会社 \n〒812-0012 福岡県福岡市博多区博多駅中央街8-1 JRJP博多ビル12F</p>\n\n<p><strong>最寄り駅：</strong>\nJR博多駅から徒歩2分（ビル直結）</p>\n\n<p><strong>勤務時間：</strong></p>\n\n<ul>\n<li>裁量労働制(コアタイムなし)/月～金曜日は出勤が必要ですが勤務時間はご自分で決めることができます。 </li>\n<li>1日の標準労働時間8時間 </li>\n<li>月の平均労働時間は160時間～180時間とONとOFFを切り替えることがしやすい風土・環境です。</li>\n</ul><p><strong>待遇 / 福利厚生：</strong></p>\n\n<ul>\n<li>国内・海外カンファレンス参加支援（年1回自由にカンファレンス参加費用を負担） </li>\n<li>語学学習支援制度（その方のレベルに応じて英語・日本語学習を支援しています） </li>\n<li>交通費支給／当社規定に基く </li>\n<li>社会保険完備 </li>\n<li>入社支援制度あり（会社規定に基づき入社支援金＋一時滞在先の提供） </li>\n<li>兼業可能（入社後承認・申請必要） </li>\n<li>JESOP（株式信託制度）ご年俸額の10％程度を株式付与</li>\n</ul><p><strong>休日・休暇：</strong></p>\n\n<ul>\n<li>完全週休2日制（土・日） </li>\n<li>祝日 </li>\n<li>年末年始休暇 </li>\n<li>慶弔休暇 </li>\n<li>有給休暇 （初年度13日　全社有給取得率86.5%　2016年実績） </li>\n<li>リフレッシュ休暇制度（勤続5年で10日間） \n（年間休日120日以上）</li>\n</ul><p><strong>【給与】</strong></p>\n\n<ul>\n<li>年俸制　600万円～</li>\n<li>職務経歴・面接結果等を考慮の上、当社規程により決定します。</li>\n<li>別途、インセンティブプラン年2回</li>\n<li>年俸に1/12を乗じた額を毎月支給</li>\n</ul><p><strong>【昇給】</strong>\n給与改定年2回</p>\n\n<p><strong>【福利厚生】</strong></p>\n\n<ul>\n<li>通勤手当(当社規定に基き)</li>\n<li>社会保険完備(雇用、労災、健康、厚生年金)</li>\n<li>選択式福利厚生手当</li>\n</ul>","how_to_apply":"<p>ご興味がある方は以下のメールアドレス宛にご連絡ください。\n<a href=\"mailto:lfk_dev_recruit@linecorp.com\">lfk_dev_recruit@linecorp.com</a>\nメールでご連絡いただく際に、Githubを見てご応募した旨、ご記入ください。</p>","company":"LINE","company_url":"http://stackoverflow.com/jobs/companies/line-corporation","company_logo":"http://github-jobs.s3.amazonaws.com/862fd822-9111-11e7-8d24-4442ea7b493b.jpg","url":"http://jobs.github.com/positions/0bc1a2c2-9112-11e7-89b2-e032ce196266"},{"id":"239f5730-a85b-11e7-9638-b8762f3ea213","created_at":"Tue Oct 03 16:52:52 UTC 2017","title":"Data Engineer","location":"San Francisco","type":"Full Time","description":"<p>If you love clean data, we want to hear from you. We are looking for a Data Engineer superhero (or wizard behind the curtain)  who will keep our exec dashboard accurate and take the Analytics team’s data infrastructure to the next level. You will work with our data infrastructure, datasets and analytics tools that are used by the Executive, Product, Marketing, Sales, Sales Engineering, Finance and Customer Success teams every day--in short, your work will impact the whole company. This is a new role for HelloSign and you will play a critical role in shaping our Analytics foundation.</p>\n\n<p>You will contribute to a variety of projects that range from designing robust and fully automated ETL processes to building tools for improving company-wide productivity with data. You have a passion for designing, implementing and operating stable, scalable and efficient solutions to flow data from production systems into the data warehouse.\nWe know new analytics technologies are emerging every day and we are excited about the impact they will have – we hope you share our enthusiasm!\nResponsibilities:</p>\n\n<p>Interface with other technology teams to extract, transform, and load (ETL) data from a wide variety of in-house and 3rd party data sources\nEnsure we have data consistency on both production and analytical databases. You will own the integrity of our data from end to end and the company will make high impact decisions based on this data.\nArchitect and build data warehouse to provide timely data to a variety of third party applications (Salesforce, Marketo, etc)\nDesign and build tools that make our data pipelines and surfacing more reliable and easier to use\nWork closely with backend engineers to roll out new tools and features\nTriage, identify, and fix scaling challengesCollaborate with internal data customers to gather requirements\nHelp develop our data engineering function in areas of data architecture, business intuition &amp; insight or potentially big data.\nRequired Skills and Qualifications:</p>\n\n<p>3+ years experience with at least one relational database—MySQL, Postgres, Oracle or other.\nSQL Scripting and Data Warehousing experience using RDBMS\nExperience with large-scale data pipelines and ETL tooling.\nAbility to write efficient SQL queries\nSome coding experience. Our ETL process is in Ruby and our development environment is LAMP stack.\nBonus Points:</p>\n\n<p>Experience with EDA (Exploratory Data Analysis) and Data Visualization (we use Tableau)\nAmazon RedshiftExperience working with data using Python (pandas, numpy, scikit-learn, etc)\nBusiness Intelligence, Analytics or Finance experience\nExperience with any Hadoop type technology (Hive, Pig, Spark, etc)\nAbout Us:</p>\n\n<p>HelloSign is creating the next generation eSignature platform, with a focus on clean usability. We were recently voted #1 eSignature solution for Small Business and #1 software solution for Mid-Market business on G2 Crowd! We’re proud of these awards because they are voted on by real users and reflect our commitment to making life better for our customers. In fact, we have the highest customer satisfaction score out of all our competitors.</p>\n\n<p>In addition to our sleek end user product, developers love our API, clean, straightforward documentation and extensive SDKs. On average, full-featured integrations average less than 2.5 days of development--the fastest in the industry. And our API Engineers offer the best support you’ll never need. Our vision is to deliver Frictionless Agreements by making our users awesome.  </p>\n\n<p>Life at HelloSign:</p>\n\n<p>We are centrally located in downtown San Francisco in SOMA near Embarcadero. Currently at 60 employees, we are growing the company deliberately, with an eye towards maintaining a culture that values lifestyle, fun and continuous improvement. We were awarded the 2015 Hirepalooza Culture Award for Lifestyle and continue to maintain an overwhelmingly positive presence on Glassdoor and The Muse.</p>\n\n<p>We have raving fans who love what we make • We're user-focused and product-driven • We're always evolving with an eye towards improvement • Committed to building a product people want • We have a well-defined culture of fun, continual learning and collaboration • A supportive, familial atmosphere • An open, airy, creative space with communal dining and lounge spaces • We love dogs • Happy hour for unwinding and partaking in shenanigans • A fully stocked kitchen with drinks and snacks • And we'll never forget your birthday!</p>\n\n<p>HelloSign is an equal opportunity employer committed to hiring a diverse team of qualified individuals • HelloSign conducts background checks; pursuant to the San Francisco Fair Chance Ordinance, HelloSign will consider for employment qualified applicants with arrest and conviction records • HelloSign participates in E-Verify.</p>","how_to_apply":"<p><a href=\"https://jobs.lever.co/hellosign/adfbc048-dfc2-4c85-b691-8e3f2ef545fa?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">https://jobs.lever.co/hellosign/adfbc048-dfc2-4c85-b691-8e3f2ef545fa?lever-origin=applied&amp;lever-source%5B%5D=GitHub</a></p>","company":"HelloSign","company_url":"http://www.hellosign.com","company_logo":"http://github-jobs.s3.amazonaws.com/21c9139c-a85b-11e7-94cc-327ba779223b.png","url":"http://jobs.github.com/positions/239f5730-a85b-11e7-9638-b8762f3ea213"},{"id":"f9b25b46-a7da-11e7-81f4-b9346c5164b6","created_at":"Tue Oct 03 01:35:50 UTC 2017","title":"Sr Software Engineer, Wi-Fi R&D","location":"Los Angeles","type":"Full Time","description":"<p>As our Research and Development Engineer you'll use current research and business insights to craft solutions that drive business success. We’re looking for an individual who is passionate about working on Wireless technologies. If you're passionate about R&amp;D, developing prototypes and building solutions then we'd love to talk with you!</p>\n\n<ul>\n<li>Working on new and upcoming Wireless technology standards and protocols</li>\n<li>Working on Mobile platforms and state of the art web technologies in the Wireless domain</li>\n<li>Working closely with Boingo teams across the company, including Engineering and Marketing.</li>\n<li>Collaborate to help evolve mobile and web frameworks, apps and systems.</li>\n<li>Build design and/or test documents to meet business objectives</li>\n</ul><p>What's the gist of the job?</p>\n\n<ul>\n<li>Willing to work on new technologies and Industry standards in and around Wireless and Networking domains.</li>\n<li>Work with Vice President, Engineering to architect, build, test solutions as demanded by Business needs</li>\n<li>Run your projects from requirements-gathering through deployment.</li>\n<li>Quickly master Amazon Web services technologies following the development, evaluation and deployment process.</li>\n<li>Lead efforts with the QA team to define release priorities and test plans and priorities; assists in testing of the related activities (planning/debugging/problem resolution) as needed</li>\n<li>Design, develop and test system enhancements requirements using AWS, node.js or related and then package the changes/additions for release including implementation instructions.</li>\n<li>Perform architecture improvements, and support activities.</li>\n</ul><p>Have you got the goods?</p>\n\n<ul>\n<li>Demonstrated 6-10 years of experience with chosen technology stack.</li>\n<li>Strong developer and architecture experience (3+ years) in AWS (or related Cloud platform)</li>\n<li>Demonstrated expertise with UNIX/Windows and Mobile (Android/iOS) platforms.</li>\n<li>6+ years programming and test experience in any Programming language; C, C++, Java, C# and Scripting languages like JavaScript, Perl, Python or Ruby etc.</li>\n<li>Development experience in node.js/Java or similar frameworks.</li>\n<li>Strong experience with development and testing in Windows OS, either using C, C++ or C#.</li>\n<li>Shown experience in development, deployment and testing of mobile apps on either Windows, Android, or iOS platforms</li>\n<li>Excellent analytical and problem-solving skills, coupled with discretion and sound independent judgment.</li>\n<li>Excellent oral and written communication skills</li>\n<li>Bachelor’s and 8-10 years or Master's and 6-8 years of equivalent development experience.</li>\n<li>Deep understanding of TCP/IP and 802.11 protocol stacks, including development, fixing and testing experience</li>\n<li>Experience in web development technologies, node.js, Apache, PHP or similar.</li>\n<li>You have experience and can thoroughly understand various Networking protocols (TCP/IP, OSI, 802.11a/b/g/n), Operating Systems (UNIX, Linux, Macintosh, VMWare), AAA (Radius), and Open Source Tools.</li>\n<li>Good overall understanding of Web based frameworks and protocols including HTTP, XML, and SOAP.</li>\n<li>6+ years’ experience working on various Version Control systems like SVN, GIT, CVS, Perforce etc.</li>\n<li>Demonstrated experience in SSL certificates and related security protocols</li>\n</ul><p>Meet Boingo\nBoingo Wireless, Inc. (NASDAQ: WIFI) helps the world stay connected. Our vast footprint of Wi-Fi and cellular networks reaches more than a billion consumers annually. From airports and stadiums to universities and military bases, Boingo helps folks stay connected to the people and things they love.</p>\n\n<p>Our team is creative, collaborative, and on the cutting edge of technology. (You can check out some of the awards we’ve won here. #humblebrag). But there’s no doubt the “secret sauce” to Boingo’s success is our incredible team and culture. We take pride in having fun and staying healthy – think summer picnics, bowling nights, in-house yoga classes, costume contests, massages and food trucks. There’s also a kitchen stocked with yummy snacks and drinks, and an incredible benefits package including equity, health, dental, vision, 401(k) match, unlimited vacation, 12 weeks paid parental leave, and more!  Plus our award-winning headquarters in Westwood boasts 360-degree views of LA, from Catalina to the Hollywood Sign. It’s no wonder we’ve been named among the Best Places to Work in LA three years in a row!</p>\n\n<p>Boingo is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, gender, gender identity, sexual orientation, age, status as a protected veteran, among other things, or status as a qualified individual with disability.</p>","how_to_apply":"<p>Please apply here: <a href=\"http://grnh.se/bya8sc1\">http://grnh.se/bya8sc1</a></p>","company":"Boingo Wireless","company_url":"http://Boingo Wireless","company_logo":"http://github-jobs.s3.amazonaws.com/96a431da-b5ce-11e7-845e-33e28d3d3ec8.png","url":"http://jobs.github.com/positions/f9b25b46-a7da-11e7-81f4-b9346c5164b6"},{"id":"f127a8ca-fdd3-11e6-81a4-fe9da905eb01","created_at":"Sat Sep 30 16:36:00 UTC 2017","title":"Data Scientist - Analytics (Full Relocation to Amsterdam)","location":"Amsterdam, the Netherlands","type":"Full Time","description":"<p>Job Description:</p>\n\n<p>Booking.com is looking for data savvy professionals to join our team of data scientists. You will be working with stakeholders throughout the company to generate understanding, strategy and suggest actions based on data. If you consider yourself to be that unique hybrid of data hacker, business analyst, communicator and mentor that maintains a strong customer focus and values pragmatism over perfection, then we’d like to hear from you.</p>\n\n<p>There are several data science teams within Booking.com each consisting of 3-8 people. All of these teams have their own scope within the business; we have Data Scientists focusing on the front end of our website, content of the pages, demands of our products, customer satisfaction and loyalty. Every team takes full responsibility for all data analysis within their area; however there is also considerable collaboration amongst teams. We often align on business goals, learn from each other and socialise after work almost every Friday.</p>\n\n<p><strong>B.responsible</strong></p>\n\n<ul>\n<li><p>Transform large, complex datasets into pragmatic, actionable insights.  </p></li>\n<li><p>Leverage data to identify, quantify and influence tangible business gain.</p></li>\n<li><p>Ability to see beyond the numbers, be the voice of data when communicating to decision makers, product owners and team leaders.</p></li>\n<li><p>Have the capacity to thrive in our fast-paced environment, adapt quickly and take ownership of your work.</p></li>\n<li><p>Challenge ideas and methods while working together with talented, highly skilled team members.</p></li>\n</ul><p><strong>B.skilled</strong></p>\n\n<ul>\n<li><p>Minimum 3 years of experience in a relevant role</p></li>\n<li><p>Experience solving real problems using data mining techniques and with statistical rigour</p></li>\n<li><p>Masters, PhD, or equivalent experience in a quantitative field (computer science, physics, mathematics, engineering, bioinformatics, etc.)</p></li>\n<li><p>Strong technical skills regarding data analysis, statistics and programming. Strong working knowledge of, Python, Hadoop, SQL, and/or R.</p></li>\n<li><p>Excellent communication skills; the ability to convey complex analysis results clearly and with conviction to all levels of stakeholders</p></li>\n</ul><p><strong>B.offered</strong></p>\n\n<p>We are a performance-based company that offers career advancement and lucrative compensation, including bonuses and stock potential.  We also offer what we call the “Booking Deal” with other competitive perks and benefits.  IT also has monthly hackathons, training and attends/speaks at global conferences.</p>\n\n<p>This position is open to worldwide candidates and in the case of relocation, we will assist you with a generous relocation package, ensuring a smooth transition to working and living in Amsterdam.  We have successfully relocated 200+ IT professionals to Amsterdam in the last year!</p>","how_to_apply":"<p>Apply via this link: <a href=\"http://grnh.se/g1tl6m\">http://grnh.se/g1tl6m</a></p>","company":"Booking.com BV","company_url":"https://www.booking.com/","company_logo":"http://github-jobs.s3.amazonaws.com/ed7a877e-fdd3-11e6-8e53-5ccd8a9399b4.jpg","url":"http://jobs.github.com/positions/f127a8ca-fdd3-11e6-81a4-fe9da905eb01"},{"id":"a10e0222-9701-11e7-99b5-3e0083d090e0","created_at":"Sat Sep 30 14:58:11 UTC 2017","title":" Senior Data Scientist","location":"Amsterdam, the Netherlands","type":"Full Time","description":"<p>Job Description:</p>\n\n<p>Booking.com is looking for data savvy professionals to join our team of data scientists. As a Senior Data Scientist, you will be working with stakeholders throughout the company to translate business needs into tangible data science projects. You will be hands on and act as a thought leader in a particular domain of expertise. You’ll also mentor new and more junior co-workers on the skills they need to build successful careers at Booking.com. If you consider yourself to be that unique hybrid of data hacker, business strategist, communicator and mentor that maintains a strong customer focus and values pragmatism over perfection, then we’d like to hear from you.</p>\n\n<p>The Data Scientists at Booking.com support all areas of our business: Customer Service, Accommodation Partners, Front End, Security… Even our newer products like Booking Home and Business Bookers. Your challenge will be utilizing our petabyte scale data to support business decisions and improve our products. Joining a cross functional team of developers, designers, and product owners, we invite you to help us crunch the data to ensure our place as the planet’s #1 accommodation site.</p>\n\n<p><strong>B.responsible</strong></p>\n\n<ul>\n<li><p>Transform large, complex datasets into pragmatic, actionable insights.   </p></li>\n<li><p>Leverage data to identify, quantify and influence tangible business gain.</p></li>\n<li><p>Ability to see beyond the numbers – be the voice of data when communicating to decision makers, product owners and team leaders.</p></li>\n<li><p>Have the capacity to thrive in our fast-paced environment, adapt quickly and take ownership of your work.</p></li>\n<li><p>Challenge ideas and methods while working with talented, highly skilled team members.</p></li>\n<li><p>Contribute to the growth of Booking.com through interviewing, on-boarding, mentoring and being the external ambassador of Booking.com</p></li>\n</ul><p><strong>B.skilled</strong></p>\n\n<ul>\n<li><p>Minimum 5 years of experience in a relevant role</p></li>\n<li><p>Masters, PhD, or equivalent experience in a quantitative field (computer science, physics, mathematics, engineering, bioinformatics, etc.)</p></li>\n<li><p>An all around data scientist: strong statistics background, experience in algorithm programming, experimentation, data visualization, machine learning, optimization and big data</p></li>\n<li><p>Experience applying Data Science to commercial problems.</p></li>\n<li><p>Experience collaborating cross functionally (i.e. Developers, UX Experts, Product Owners, etc.)</p></li>\n<li><p>Strong working knowledge of Python, Hadoop, SQL, R or similar technologies.</p></li>\n<li><p>Excellent communication skills; the ability to convey complex analysis results clearly and with conviction to all stakeholder levels</p></li>\n<li><p>Interest and experience in coaching, mentoring and technical leadership</p></li>\n</ul><p>For this position we also require strong expertise in applying at least one of the following fields or problem domains:</p>\n\n<ul>\n<li>Machine Learning, Reinforcement Learning, Deep Learning, Natural Language Processing, Speech Recognition, Computer Vision, Recommender Systems, Information Retrieval, Game Theory, Econometrics, Operations Research, Causal Inference / Experimentation, Forecasting, or another area of your choice that you think will help us to give our customers the best experience in the world!</li>\n</ul><p><strong>B.offered</strong></p>\n\n<p>We are a performance-based company that offers career advancement and lucrative compensation, including bonuses and stock potential.  We also offer what we call the “Booking Deal” with other competitive perks and benefits.</p>\n\n<p>This position is open to worldwide candidates and, in the case of relocation, we will assist you with a generous relocation package, ensuring a smooth transition to working and living in Amsterdam.</p>","how_to_apply":"<p>Apply via this link: <a href=\"http://grnh.se/tuelvc1\">http://grnh.se/tuelvc1</a></p>","company":"Booking.com BV","company_url":"https://www.booking.com/","company_logo":"http://github-jobs.s3.amazonaws.com/8f0c7072-9701-11e7-821d-5cf19302b830.jpg","url":"http://jobs.github.com/positions/a10e0222-9701-11e7-99b5-3e0083d090e0"},{"id":"64ec42b8-a52f-11e7-9856-4bdf9434e6a9","created_at":"Fri Sep 29 16:05:05 UTC 2017","title":"Experienced Dev Ops / Systems Engineer","location":"Remote (U.S.)","type":"Full Time","description":"<h2>Overview</h2>\n\n<p>This full-time role will focus on maintaining, extending, and supporting Peerfit’s backend infrastructure &amp; API's to continue scaling and growing our platform. An ideal candidate will also have experience supporting and optimizing processes around IT operations and security. You will work with a tight knit team of developers to plan and prioritize feature sets and architecture at the heart of Peerfit.</p>\n\n<p>You will need experience with docker and kubernetes as well as being comfortable programming in python. Having experience with Django and Django Rest Framework is preferred as well as experience with Google Cloud Platform. This is a great opportunity to work with cutting edge technology to positively influence change in the wellness sector and in people's lives.</p>\n\n<p>Experience with security, Google Apps administration, Zendesk administration, and data warehousing to support BI tools like Looker or Tableau are a plus.</p>\n\n<h2>Who we need</h2>\n\n<ul>\n<li>Passionate about health and fitness</li>\n<li>Desires to have a role in the growth of a startup</li>\n<li>Stays motivated and knows how to be persistent</li>\n<li>Able to stay organized while managing a backlog of issues of various priorities</li>\n<li>Enjoys digging through details to find improvements</li>\n<li>An individual that is motivated by improving Peerfit’s user experience</li>\n<li>Is self-directed</li>\n<li>Can work remotely and make decisions autonomously at a high level</li>\n<li>Flexibility to handle changing responsibilities</li>\n</ul><h2>What You Get</h2>\n\n<ul>\n<li>The opportunity to work in a relaxed, yet goal-driven start-up culture with a passion for fitness</li>\n<li>Remote first team</li>\n<li>Health Insurance &amp; other benefits</li>\n<li>Free fitness classes through Peerfit</li>\n<li>Salary &amp; bonuses based on performance</li>\n<li>The opportunity to help expand the impact of Peerfit across the United States and, someday, the world!</li>\n</ul><p><strong>Applicants must be based in the U.S. and authorized to work in the U.S.</strong></p>","how_to_apply":"<p>Email your resume to <a href=\"mailto:productjobs@peerfit.com\">productjobs@peerfit.com</a></p>","company":"Peerfit","company_url":"https://peerfit.com","company_logo":"http://github-jobs.s3.amazonaws.com/52e70b2a-a52f-11e7-9a3f-964ea45128d7.png","url":"http://jobs.github.com/positions/64ec42b8-a52f-11e7-9856-4bdf9434e6a9"}]

